[
    {
        "title": "English coordinator",
        "company": "Wisdom Academy",
        "about": "School of Wisdom Academy would like to invite qualified, competent and experienced candidate for the following positionsEnglish coordinator Gender : male/femaleRequired number: 10Salary: - Very Attractive",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/ZidK6Oks6o-english-coordinator"
    },
    {
        "title": "Senior Sales Expert",
        "company": "Shemu Group",
        "about": "We are looking for an experienced Senior Sales Expert to lead and grow our EV sales operations. If you’re passionate about sustainable transport and have strong sales skills.Key Responsibilities:Sell electric vehicles to individual and corporate customers (B2C &amp; B2B)Conduct product demos and test drivesBuild and maintain strong customer and partner relationshipsAchieve monthly and quarterly sales targetsKeep up with EV market trends and competitor activityMaintain proper records using CRM tools",
        "location": "Addis Ababa",
        "deadline": "August 29th, 2025",
        "url": "https://ethiojobs.net/job/wmc4i955J4-senior-sales-expert"
    },
    {
        "title": "Administration and Logistics Assistant",
        "company": "Ethiopian Red Cross Society (ERCS)",
        "about": "Internal /External Vacancy AnnouncementThe Ethiopian Red Cross Society (ERCS) wants to recruit employees in the following vacant positions the details of which are mentioned below.About the Ethiopian Red Cross SocietyThe Ethiopian Red Cross Society (ERCS) was established in 1935 and is one of the oldest and largest humanitarian organizations in Ethiopia. ERCS providesservices to communities affected by natural and manmade disasters through the provision of emergency responses, ambulance and first aid, family reu...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/FCmLUW3jXn-administration-and-logistics-assistant"
    },
    {
        "title": "School Director / Principal",
        "company": "Indian International Academy PLC",
        "about": "The Indian International School (IIS) is in need of hiring a highly qualified, experienced, and visionary School Principal to lead one of its branch campuses. This position requires a passionate educator and an effective administrator who can inspire staff, engage the school community, and drive continuous improvement across all areas of school life. If you are an educational leader who thrives in a multicultural setting and is committed to nurturing future-ready global citizens, we welcome your application.Job ...",
        "location": "Addis Ababa",
        "deadline": "August 28th, 2025",
        "url": "https://ethiojobs.net/job/tNfmAOnI0Q-school-director-principal"
    },
    {
        "title": "SUPPORT CORDINATOR",
        "company": "Toppan Security Ethiopia S.C",
        "about": "­Job Title- Support CoordinatorJob Summary:The In-Country Support Coordinator is responsible for coordinating and delivering local operational and technical support for projects, systems, and services for Ethiopia. This role serves as the primary liaison between the in-country teams, regional management, and global support teams, ensuring that service standards, and user needs are met efficiently and professionally.Key Responsibilities:Provide first-line support to end-users and escalate complex issues to region...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/erfmugonsF-support-cordinator"
    },
    {
        "title": "Senior Accountant",
        "company": "Ethiopian Red Cross Society (ERCS)",
        "about": "Internal /External Vacancy AnnouncementThe Ethiopian Red Cross Society (ERCS) wants to recruit employees in the following vacant positions the details of which are mentioned below.About the Ethiopian Red Cross SocietyThe Ethiopian Red Cross Society (ERCS) was established in 1935 and is one of the oldest and largest humanitarian organizations in Ethiopia. ERCS providesservices to communities affected by natural and manmade disasters through the provision of emergency responses, ambulance and first aid, family reu...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/nbEWn4Xcra-senior-accountant"
    },
    {
        "title": "Public Health Officer",
        "company": "Ethiopian Red Cross Society (ERCS)",
        "about": "Internal /External Vacancy AnnouncementThe Ethiopian Red Cross Society (ERCS) wants to recruit employees in the following vacant positions the details of which are mentioned below.About the Ethiopian Red Cross SocietyThe Ethiopian Red Cross Society (ERCS) was established in 1935 and is one of the oldest and largest humanitarian organizations in Ethiopia. ERCS providesservices to communities affected by natural and manmade disasters through the provision of emergency responses, ambulance and first aid, family reu...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/53H3lmRgSV-public-health-officer"
    },
    {
        "title": "Executive Assistance",
        "company": "Ethiopian Red Cross Society (ERCS)",
        "about": "Internal / External Vacancy AnnouncemenThe Ethiopian Red Cross Society (ERCS) wants tohire employees in the following vacant positions the details of which are mentioned bellow.About the Ethiopian Red Cross SocietyThe Ethiopian Red Cross Society (ERCS) was established in 1935 and is one of the oldest and largest humanitarian organizations in Ethiopia. ERCS providesservices to communities affected by natural and manmade disasters through the provision of emergency responses, ambulance and first aid, family reunif...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/vdVhnzukzK-executive-assistance"
    },
    {
        "title": "Field Project Coordinator, TOV Le’Isua Project",
        "company": "American Jewish Joint Distribution Committee(AJJDC)",
        "about": "Reports to: TOV Le’Isua Program ManagerDuty Station:Addis AbabaContract Type:Project-Based Contract for 1-YearDuration:August 15, 2025 – September 30, 2026Overview of the ProjectThe TOV Le’isua project, implemented by the American Jewish Joint Distribution Committee (JDC) in collaboration with the CARE WE-GO Program, aims to improve the livelihoods of smallholder farmers with a focus on women engagement, in Sidama and Amhara regions through the adoption of climate-smart, gender-responsive agricultural technologi...",
        "location": "Addis Ababa",
        "deadline": "August 9th, 2025",
        "url": "https://ethiojobs.net/job/z5KyN3hBS3-field-project-coordinator-tov-leisua-project"
    },
    {
        "title": "Shift Technologist - Curing",
        "company": "Horizon Addis Tyre Manufacturing P.L.C.",
        "about": "Salary; AttractiveJob Category; Tyre Technology and Quality Assurance",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/5bCav3YnKK-shift-technologist-curing"
    },
    {
        "title": "Cashier",
        "company": "Horizon Addis Tyre Manufacturing P.L.C.",
        "about": "Salary; AttractiveJob Category; Finance and Accounting",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/A8r5gkBPzV-cashier"
    },
    {
        "title": "Laboratory/Vulcanizing press operator specific  Gravity tester and Sampler",
        "company": "Horizon Addis Tyre Manufacturing P.L.C.",
        "about": "Salary; AttractiveJob Category; Quality Assurance",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/YLkmbhfBd4-laboratoryvulcanizing-press-operator-specific-gravity-tester-and-sampler"
    },
    {
        "title": "Sales and Marketing Manager",
        "company": "SHOBOLE ELECTROMECHANICAL",
        "about": "A sales manager oversees a company’s entire sales process. He/She is responsible for developing and implementing a sales strategy that caters to the strengths of the sales team. As a sales manager, you will have a hand in product development, market research, initial release, ongoing marketing, and data analysis.He/She will generate new business leads, and oversee sales and marketing department staff. He/she also manages sales and marketing budgets and analyze trends.Key Competencies and Skills:Digital Marketing...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/rh7BEPka2z-sales-and-marketing-manager"
    },
    {
        "title": "Ticket Officer",
        "company": "Wado Travel Services PLC",
        "about": "Job Vacancy: Ticket OfficerCompany: Wado Travel ServicesLocation: Remote (first 6 months), then full-time from officeEmployment Type: Full-TimeSalary: Base Salary + Commission on every air ticketAbout Us:Wado Travel Services is a dynamic and fast-growing travel agency dedicated to offering customized travel solutions. We specialize in air ticketing, group bookings, tours, and corporate travel services.Position Summary:We are looking for a highly motivated and detail-oriented Ticket Officer with a minimum of 2 ye...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/lzbkxpsaSo-ticket-officer"
    },
    {
        "title": "Junior Mechanic",
        "company": "Amaga Private Limited Company",
        "about": "Job Title: Junior MechanicDepartment: Technic HeadReports To: Senior MechanicMain Purpose: Assist in machine maintenance while learning mechanical systemsKey Responsibilities:- Assist with repairs- Support machine inspections- Monitor operations and report faults- Keep tools and area clean",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/AsLKfq0ZMf-junior-mechanic"
    },
    {
        "title": "Electrician",
        "company": "Amaga Private Limited Company",
        "about": "Job Title: ElectricianDepartment: Technic HeadReports To: Senior ElectricianMain Purpose: Install, maintain, and repair electrical systems in the factoryKey Responsibilities:Install electrical systems, wiring, and fixtures for foam production equipment, lighting, and control systems.Perform regular inspections and preventive maintenance on electrical machinesIdentify faults and carry out repairs on motors, panels, relays, switches, and other electrical components.Diagnose and resolve issues with power supply, co...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/BehK8q8VjH-electrician"
    },
    {
        "title": "Safety Officer",
        "company": "Amaga Private Limited Company",
        "about": "Job Title: Safety OfficerDepartment: Factory ManagerReports To: Factory ManagerMain Purpose: Maintain a safe workplace and ensure legal safety complianceKey Responsibilities:Conduct daily safety inspections of foam production areas (mixing, cutting, storage, etc.)Recommend control measures to reduce workplace hazards.Monitor handling and storage of hazardous chemicals to prevent fire, explosion, or exposure.Organize safety training sessions, fire drills, and emergency response simulations.Educate staff on safe h...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/pO604yaq4t-safety-officer"
    },
    {
        "title": "Mechanic",
        "company": "Amaga Private Limited Company",
        "about": "Job Title: MechanicDepartment: Technic HeadReports To: Senior MechanicMain Purpose: Maintain and repair foam machinery to minimize downtimeKey Responsibilities:Carry out preventive and corrective maintenance on production machines.Ensure all moving parts are  properly lubricated and functioningDiagnose mechanical faults and breakdowns in foam processing equipment.Repair or replace defective parts such as bearings, gears, belts, shafts, and valves.Maintain accurate records of maintenance work, breakdown reports, ...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/UnWeK9DLsj-mechanic"
    },
    {
        "title": "Production Quality Control Officer",
        "company": "Amaga Private Limited Company",
        "about": "Job Title: Production Quality Control OfficerDepartment: ProductionReports To: Factory ManagerMain Purpose : Ensure foam products meet quality standards through testing and monitoringKey Responsibilities:Inspect raw materials, in-process foam, and finished products.Conduct density, hardness, compression set, tensile, and elongation tests.Monitor color, consistency, and dimensions of foam blocks/sheets.Supervise foam production parameters (e.g., TDI/Polyol ratios, temperature, and rise time).Ensure correct usage ...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/yRLm1hFlJv-production-quality-control-officer"
    },
    {
        "title": "ASSIGNMENT EDITOR",
        "company": "Independent News & Media PLC",
        "about": "JOBThe successful applicant must be able to supervise and train reporters, handle the pressure of daily and weekly deadlines, and lead by example with top-notch writing and reporting skills.S/he must be proficient in reacting to and covering breaking news and also identify trends and write features in numerous business arenas.Applicants must have excellent sources and produce ground-breaking stories about the business sector, together with the reporters they work with. They source and assign reporters to various...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/5QYoe5Sz4S-assignment-editor"
    },
    {
        "title": "Deputy Editor-In-Chief",
        "company": "Independent News & Media PLC",
        "about": "INDEPENDENT NEWS &amp; MEDIA PLC., is a publisher of the business weekly Fortune, reputable for its comprehensive coverage of business, investment, and economic issues across various platforms, including print, digital, video, and audio. Our commitment to delivering high-quality journalism is matched by our dedication to innovative design and compelling visual storytelling.POSITION OVERVIEW: We are seeking a dynamic and experienced Deputy Editor-in-Chief to join our editorial team. The ideal candidate will have ...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/17USVnk5mc-deputy-editor-in-chief"
    },
    {
        "title": "Senior Growth and Sales Lead",
        "company": "ChipChip.",
        "about": "Recruit and onboard a new sales repLead and supervise sales activitiesTrain reps on product, approach, and target achievementMonitor performance and ensure team targets are metIdentify new areas or customer groups for expansionReport sales results to Area and Line ManagersGather feedback to improve team effectivenessSkills &amp; Qualities:Strong communication and leadershipGoal-oriented and self-motivatedComfortable with tracking results and using tools like Google Sheets or FormsWilling to travel when neededFlu...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/wGvt1GEy0L-senior-sales-and-growth-lead"
    },
    {
        "title": "Sales and Marketing Professionals",
        "company": "Ye Ethiopia Lijoch Media",
        "about": "About the RoleWe are looking for ambitious and results-driven Sales and Marketing Professionals to join our growing team. The ideal candidates will be responsible for driving sales growth, building strong client relationships, and implementing marketing strategies to increase brand visibility and generate leads.Key ResponsibilitiesSales:Identify and pursue new business opportunities and leads.Meet or exceed sales targets through direct outreach, presentations, and relationship-building.Conduct market research to...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/jHLD6eGB1I-sales-and-marketing-professionals"
    },
    {
        "title": "Graphic Designers",
        "company": "Ye Ethiopia Lijoch Media",
        "about": "We are expanding our creative team and looking to hire four passionate and skilled Graphic Designers — two fresh graduates ready to kick-start their careers and two experienced designers with at least 3 years of proven industry experience.Whether you're just starting out or looking to grow your creative portfolio further, this is a great opportunity to work on diverse projects in a collaborative and dynamic environment.Key Responsibilities (for all roles)Design visually appealing graphics for digital and print m...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/nrqAmTyWIi-graphic-designers"
    },
    {
        "title": "Video Editors",
        "company": "Ye Ethiopia Lijoch Media",
        "about": "About the RoleWe are looking for a talented and detail-oriented Video Editor to join our team. The ideal candidate will have a strong creative vision, technical skills, and the ability to transform raw footage into compelling video content that aligns with our brand and objectives.Key ResponsibilitiesEdit video content for various platforms including social media, websites, advertisements, and internal use.Cut, trim, and assemble footage into polished final products using editing software.Add music, sound effect...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/Ud2HNAdcuD-video-editors"
    },
    {
        "title": "Junior Accountant",
        "company": "SHOBOLE ELECTROMECHANICAL",
        "about": "Responsible for the entry, analysis and maintenance of the general ledger with particular focus on accounts payable and disbursements, cash management support, monthly and year end close support, and participation in the implementation of sound internal and compliance controls. He/She will work closely with the Finance Manager.Salary: Negotiable",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/4rhPYxBVFX-sales-and-marketing-manager"
    },
    {
        "title": "Security & External Relation Manager",
        "company": "Holland Dairy P.L.C",
        "about": "The Security and External Relations Manager will be responsible for overseeing the safety and security of company operations across Ethiopia, ensuring the protection of personnel, assets, and information. This role also involves managing external relations with key stakeholders, including government authorities, peer organizations, and security networks.1. Security Monitoring &amp; IntelligenceContinuously monitor the security situation in Ethiopia, with a focus on areas where the company operates.Maintain up-to...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/fA2YDEDpfi-security-external-relation-manager"
    },
    {
        "title": "Staff Assistant, G-5",
        "company": "United Nations Economic Commission for Africa (UNECA)",
        "about": "ECA's mission is to deliver ideas and actions for an empowered and transformed Africa, informed by the 2030 SDGs and Agenda 2063. The mission is guided by ECA's five new strategic directions which are: advancing ECA's position as a premier knowledge institution that builds on its unique position and privilege to bring global solutions to the continent's problems and take local solutions to the continent; developing macroeconomic and structural policy options to accelerate economic diversification and job creatio...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/0sVVYvkGSk-staff-assistant-g-5"
    },
    {
        "title": "Junior Accountant",
        "company": "Hadeed Trading Plc",
        "about": "Junior AccountantCategory: Finance DepartmentLocation: Addis Ababa, Near Bisrate Gebriel Church (South Africa Embassy)Career Level: Junior LevelEmployment Type: Full timeSalary: Company ScaleJob DescriptionBackground of the companyHadeed Trading Plc is a company established in the year 2003 in Addis Ababa, Ethiopia which is involved in manufacturing, export, import and distribution of different types of products. Hadeed entered the manufacturing sector by opening a galvanizing plant in 2005 and also started supp...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/XA72J4XTc6-junior-accountant"
    },
    {
        "title": "Senior Sales Officer",
        "company": "Droga Health Sacco",
        "about": "Job Title: Senior Sales OfficerLocation:Addis Ababa, Piassa areaReporting To:CEOIndustry:Financial Services (SACCO/Cooperative)Work Condition: Monday through Friday Full Day and Saturday, Half Day.Educational Background: BA and above in any Business related fieldsWork experience: RelevantEmployer: Droga Health SaccoAbout UsDroga Health SACCO is a community-driven cooperative committed to advancing health sector improvement through innovative savings, credit, and investment products. It is a new financial solutio...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/I0Sh0Y2Ohn-senior-sales-officer"
    },
    {
        "title": "Head of Customer Service",
        "company": "Droga Health Sacco",
        "about": "Job Title: Head of Customer ServiceLocation:Addis Ababa,Piassa AreaReporting To:CEOIndustry:Financial Services (SACCO/Cooperative)Work Condition: Monday through Friday Full Day and Saturday, Half DayQualification: BA Degree and above in any business related fieldsWork Experience: RelevantEmployer: Droga Health SaccoAbout UsDroga Health SACCO is a community-driven cooperative committed to advancing health sector improvement through innovative savings, credit, and investment products. It is a new financial solutio...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/EdxYTWJtzD-head-of-customer-service"
    },
    {
        "title": "Head of Business Development",
        "company": "Droga Health Sacco",
        "about": "Job Title: Head of Business DevelopmentLocation:Addis Ababa,PiassaReporting To:CEOIndustry:Financial Services (SACCO/Cooperative)Work Condition: Monday through Friday Full Day and Saturday, Half Day.Qualification: BA and above in any Business related fieldsWork experience: RelevantEmployer: Droga Health SaccoAbout UsDroga Health SACCO is a community-driven cooperative committed to advancing health sector improvement through innovative savings, credit, and investment products. It is a new financial solutionby and...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/SOziZlUoyF-head-of-business-development"
    },
    {
        "title": "Project Manager",
        "company": "Shega Media and Technology PLC",
        "about": "About Shega:Shega is on a mission of elevating decision-making in Africa, through media, data &amp; Intelligence services to elevate business decision making and empower businesses, development partners, and innovators with the tools and insights they need to grow. We also provide Agency Services to help brands and organizations connect with our expanding audiences. By combining intelligence, an audience ecosystem, and tailored advisory, Shega partners with local and international private and development actors ...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/RRuXMMgPX7-project-manager"
    },
    {
        "title": "Senior Technical Advisor - Bale Mountains National Park, Ethiopia",
        "company": "Frankfurt Zoological Society",
        "about": "The Bale Mountains are one of Africa’s hidden treasures — home to rare wildlife, spectacular landscapes and a watertower for millions of people in the region. Frankfurt Zoological Society (FZS) has worked alongside the Ethiopian Wildlife Conservation Authority (EWCA) for over 20 years to protect this extraordinary landscape.We’re looking for a dedicated Senior Technical Advisor to lead the charge in strategic park management at Bale Mountains National Park (BMNP). Based at park headquarters in Dinsho, you work i...",
        "location": "Oromia",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/OnLNIaskId-senior-technical-advisor-bale-mountains-national-park-ethiopia"
    },
    {
        "title": "Senior Odoo Developer",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Job SummaryWe are looking for an experienced Senior ODOO Developer to design and develop ERP solutions tailored to our business needs. The ideal candidate should have strong expertise in Python, ODOO framework, and custom module development. You will collaborate with cross-functional teams to enhance ODOO functionalities, integrate third-party applications, and optimize system performance.Key ResponsibilitiesDevelop, customize, and maintain ODOO modules based on business requirements.Design and implement new fea...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/RUMiUX1BqT-senior-odoo-developer"
    },
    {
        "title": "Senior Program Manager , Africa Region -Ethiopia",
        "company": "Vital Strategies",
        "about": "Company ProfileVital Strategies is an international public health organization headquartered in New York City. Our programs strengthen public health systems and address the world’s leading causes of illness, injury and death. We work in more than 80 countries, supporting data-driven decision-making in government, advancing evidence-based public health policies, and mounting strategic communication campaigns. Vital Strategies’ priorities are driven by the greatest potential to improve and save lives. They include...",
        "location": "Not Specified",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/SXPkTRk9A6-senior-program-manager-africa-region-ethiopia"
    },
    {
        "title": "Program Associate, Ethiopia",
        "company": "Vital Strategies",
        "about": "Company ProfileVital Strategies is an international public health organization headquartered in New York City. Our programs strengthen public health systems and address the world’s leading causes of illness, injury and death. We work in more than 80 countries, supporting data-driven decision-making in government, advancing evidence-based public health policies, and mounting strategic communication campaigns. Vital Strategies’ priorities are driven by the greatest potential to improve and save lives. They include...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/0gJvV8S2Ma-program-associate-ethiopia"
    },
    {
        "title": "Lead Poisoning Surveillance Coordinator, Ethiopia",
        "company": "Vital Strategies",
        "about": "Company ProfileVital Strategies is an international public health organization. Our programs strengthen public health systems and address the world’s leading causes of illness, injury and death. We currently work in 73 countries, supporting data-driven decision making in government, advancing evidence-based public health policies, and mounting strategic communication campaigns. Vital Strategies’ priorities are driven by the greatest potential to improve and save lives. They include non-communicable disease preve...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/1zz1ovmSIZ-lead-poisoning-surveillance-coordinator-ethiopia"
    },
    {
        "title": "Managerial Assistant/Inventory Manager",
        "company": "Nano Technologies PLC",
        "about": "We are seeking a trustworthy, organized, and motivated individual to join our team in a position as inventory manager and managerial Assistant. The ideal candidate will be flexible and capable of handling both internal operations and external office-related tasks.Key Responsibilities:Storekeeping Duties:Receive, inspect, and record incoming goods and materials.Organize and maintain proper storage and inventory tracking.Issue materials based on requests and maintain accurate stock records.Monitor inventory levels...",
        "location": "Addis Ababa",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/BHtLwmPuio-managerial-assistantinventory-manager"
    },
    {
        "title": "Senior Accountant",
        "company": "AQ Roses PLC",
        "about": "BackgroundAQ Roses is a company that produces different kinds of flowers starting from 2006 based in Ziway, Oromia. The company had started its farming on 18 hectares based in the shores of Lake Denbel. Having maintained its qualities and quantities, currently AQ Roses flower farm has expanded its farming to 38 hectares instead of 18 hectares. Recently we have expanded our farm to Bishoftu as well.Scope of the positionThe Senior Cost Accountant is responsible for leading the financial accounting, reporting, inte...",
        "location": "Oromia",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/vSDErBGsbJ-senior-accountant"
    },
    {
        "title": "Sales Representative",
        "company": "Aynalem Amare Import Export",
        "about": "About the CompanyAynalem Amare Import &amp; Export is a leading Ethiopian trading company based in Addis Ababa, specializing in the extraction, processing, and global export of high-value minerals and agricultural products. With a strong commitment to ethical practices, the company engages in legal mining operations across Ethiopia and other African nations, supplying quality minerals such as nickel, chrome, quartz, copper ore, and muscovite. In addition to its core mineral trade, Aynalem Amare exports agricultu...",
        "location": "Addis Ababa",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/XTE98uuyxU-sales-representative"
    },
    {
        "title": "Senior Bakery & Pastry Instructor",
        "company": "Puratos Ethiopia Food Industries S.C.",
        "about": "Job Summary:We are seeking a highly experienced and passionateBakery &amp; Pastry Instructorto join our culinary education team. The ideal candidate will have15+ years of hands-on experiencein bakery and pastry arts, with a strong background in teaching, mentoring, and curriculum development. This role involves delivering high-quality instruction, inspiring students, and maintaining industry standards in both traditional and modern baking techniques.Key Responsibilities:Deliver engaging and practical instruction...",
        "location": "Addis Ababa",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/FVdlVMSWs2-senior-bakery-pastry-instructor"
    },
    {
        "title": "Accountant-Secretary",
        "company": "Yezha edroch Hibret business s.c",
        "about": "Position: Accountant-SecretaryEmployment Type: PermanentSalary: NegotiableGender: FemaleAge Range: 20–35 yearsNo of People Required : 2Yezha Eidroch Hibret Business S.C is seeking qualified and dedicated candidates for the position of Accountant-Secretary. This role combines administrative duties with financial record-keeping responsibilities.",
        "location": "Addis Ababa",
        "deadline": "August 10th, 2025",
        "url": "https://ethiojobs.net/job/QTuNsdQdLV-accountant-secretary"
    },
    {
        "title": "Digital Marketing Manager",
        "company": "Transsion Manufacturing PLC",
        "about": "Develop and execute comprehensive digital marketing plans aligned with company goals.Manage and optimize digital campaigns across platforms including Google Ads, Facebook, Instagram, LinkedIn, and others.Oversee content creation and strategy for websites, blogs, social media, email campaigns, and other digital channels.Analyze data and performance metrics to measure effectiveness and ROI of campaigns; prepare reports for stakeholders.Manage social media accounts, ensuring consistent branding and engagement.Coord...",
        "location": "Addis Ababa",
        "deadline": "August 10th, 2025",
        "url": "https://ethiojobs.net/job/QvzeDKNMR8-digital-marketing-manager"
    },
    {
        "title": "Quality Control Supervisor",
        "company": "Puratos Ethiopia Food Industries S.C.",
        "about": "Join the MagicOur MissionAt Puratos, we create innovative food solutions for the health and well-being of people everywhere. As the global leader in bakery, patisserie and chocolate ingredients, we help our customers to be successful with their business, by turning technologies and experiences from food cultures around the world into new opportunities.We are more than 10.000 employees in over 70 countries and a consolidated turnover of 2.8 billion euros (in 2022). Our passion for innovation, a pioneering spirit ...",
        "location": "Addis Ababa",
        "deadline": "August 10th, 2025",
        "url": "https://ethiojobs.net/job/MtJWk2twHL-quality-control-supervisor"
    },
    {
        "title": "Sales Team Lead",
        "company": "Dodai Manufacturing Plc.",
        "about": "About Dodai:Dodai Manufacturing Plc (Dodai), is a recently incorporated organization launched in Addis Ababa, Ethiopia on August 01, 2023. Dodai is a fast growing organization with a mission of making urban e-mobility accessible to everyone in Africa through its innovative products and services. Dodai plans to provide brand new electric two wheelers by assembling them here in Addis Ababa and plans to expand to major regional cities in Ethiopia by the end of 2025. It’s thus looking to engage dynamic Ethiopian tal...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/lJmaSv4MgE-junior-sales-team-lead"
    },
    {
        "title": "Food preparation",
        "company": "Ethio Resort PLC",
        "about": "Food preparation Permanent (Full-time)Required number: 6Good discipline, eager to work and learn, loyalty, trust worthy and positive thinkerBushoftu Adulala Resort &amp; Spa",
        "location": "Oromia",
        "deadline": "August 10th, 2025",
        "url": "https://ethiojobs.net/job/nUsgkiC3rd-food-preparation"
    },
    {
        "title": "Reception",
        "company": "Ethio Resort PLC",
        "about": "Computer Knowledge, Cnet SoftwareGood discipline, eager to work and learn, loyalty, trust worthy and positive thinkerRequired number : 2Permanent (Full-time)",
        "location": "Addis Ababa",
        "deadline": "August 10th, 2025",
        "url": "https://ethiojobs.net/job/87AO0oM1z6-reception"
    },
    {
        "title": "Invitation to Bid for Program Audit",
        "company": "ACTION AGAINST HUNGER",
        "about": "Invitation to Bid for Program AuditFD-ADD-03444                                        BackgroundFounded in 1979, Action Against Hunger is an international humanitarian organization committed to ending child hunger. It is a non-governmental, non-political, and non-profit organization registered by the FDRE Authority for CivilSociety Organizations of Ethiopia. Action Against Hunger established its Country Office in Ethiopia in 1985 in response to the severe drought and subsequent famine at the time and has since ...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/b3RA7wPmrt-invitation-to-bid-for-program-audit"
    },
    {
        "title": "Pharmaceutical Director",
        "company": "Ahadu PLC",
        "about": "MAJOR DUTIES AND RESPONSIBILITIESDevelop the strategic plan of the business unit that is in line with the overall strategy of the company.Develop a communication plan and provide strategic direction.Provide insights and business unit specific support to the corporate marketing unit in the development of marketing strategy.Develop a business plan covering sales, revenue, and expense controls, meeting agreed targets, and promoting the organization’s presence throughout the country.Lead the development of procureme...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/JvatCr0Fmb-pharmaceutical-director"
    },
    {
        "title": "Senior Bid Organizer",
        "company": "At-Con Engineering & Architecture Consultancy PLC",
        "about": "At-Con Engineering &amp; Architecture Consultancy Plc. is seeking qualified Professionals with expertise to join our dynamic team.In the following positionSenior Bid Organizer,Quantity Engineer, Resident Engineer, Assistant Resident engineer, Human Resource management and Documentation ClerkPosition Title:Senior Bid OrganizerLocation:Addis AbabaEmployment Type:Full-TimeExperience Required:Minimum 6 Years in a Consulting RoleAt-Con Engineering &amp; Architecture Consultancy Plc., a well-established and reputable ...",
        "location": "Addis Ababa",
        "deadline": "August 15th, 2025",
        "url": "https://ethiojobs.net/job/ONtFVH64ne-senior-bid-organizer"
    },
    {
        "title": "Principal",
        "company": "Flipper International School PLC",
        "about": "We are seeking an accomplished and visionary Principal to lead our International School (Flipper International School). The ideal candidate will demonstrate strong leadership, academic excellence, and a commitment to fostering an inclusive and dynamic learning environment. The principal will oversee school operations, uphold academic standards, and promote a culture of continuous improvement aligned with Cambridge International Education standards.Key Responsibilities:Provide strategic leadership and vision to e...",
        "location": "Addis Ababa",
        "deadline": "August 15th, 2025",
        "url": "https://ethiojobs.net/job/8WJWINhKCe-principal"
    },
    {
        "title": "Accountant",
        "company": "Deen Pire Trading",
        "about": "Deenpire Trading PLC is a trading company located at the heart of Merkato with the aspiration of becoming one of the leading trading companies in Ethiopia. Currently we are looking for competitive and energetic staff on the following vacant position   Job Title: Accountant Salary: NegotiableJob descriptionReview and verify the payment requests from petty cash, purchase funds or check payments and ensure the timely replenishment of these funds so that sufficient cash will always be available in the hands of the c...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/fNOCKWfLDv-accountant"
    },
    {
        "title": "Import Officer",
        "company": "Deen Pire Trading",
        "about": "Deenpire Trading PLC is a trading company located at the heart of Merkato with the aspiration of becoming one of the leading trading companies in Ethiopia. Currently we are looking for competitive and energetic staff on the following vacant position   Job Title: Import OfficerSalary: NegotiableJob descriptionPrepare all the required import documents and facilitate import permits from concerned authoritiesHandle all import shipments as per the import procedures and requirements in collaboration with concerned aut...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/X56VBRBQBe-import-officer"
    },
    {
        "title": "Junior Sales Officer",
        "company": "Woda Vehicle Manufacturing PLC",
        "about": "Actively identify and pursue new sales opportunities for electric vehicles through various channels.Build and maintain strong relationships with individual and corporate clients.Understand customer needs and recommend suitable EV products and solutions.Meet and exceed sales targets and contribute to the growth of the business.Conduct product presentations, test drives, and demonstrations.Stay updated on industry trends, product knowledge, and competitor activities.Support post-sales service and customer satisfac...",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/PAcXXYeAjv-junior-sales-officer"
    },
    {
        "title": "HR – Admin and Recruitment Officer",
        "company": "FW Agro Production",
        "about": "Job title:-HR – Admin and Recruitment OfficerReport to-Human Resource and Administration ManagerLocation:SUMITEmployment Type:Full timeJob summary:-The policies and procedures that’s needed to be practiced in order to carry out HR aspects including selecting, screening, onboarding and inducting new employees, compensation management, training and development, rewarding, appraising, and building employee commitment to achieve company cooperate goals.JOB DESCRIPTION:-As per the set budget, closely follow up and mo...",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/uUHlG0WX8v-hr-admin-and-recruitment-officer"
    },
    {
        "title": "Core network engineer",
        "company": "Huawei Technologies Ethiopia PLC",
        "about": "As Core network engineer support customer to resolve Live network issueSupport customer or the 3rd service requirementProcess maintenance task to clear network risk/issue, such as risk/precaution/rectification/upgradeBe responsible for Core network project deliveryBe responsible for customer communication, and develop good customer ship",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/DE5fTaFDAB-core-network-enginner"
    },
    {
        "title": "Senior General Service Officer",
        "company": "Cadila Pharmaceuticals (Ethiopia) PLC",
        "about": "Cadila Pharmaceuticals India is an integrated Healthcare Solutions provider driven by “Passion to innovate to Life”, enjoying more than 70 years of Healthcare heritage worldwide with Regulatory Approvals from USFDA, MHRA, TGA, MCC, and WHO. The company is rapidly expanding its global matrix both in terms of manufacturing facilities and market reach. Cadila Pharmaceuticals (Ethiopia) P.L.C, a Joint Venture Company between Cadila Pharmaceuticals Limited, India and AlmetaImpex P.L.C, Ethiopia, put up a Pharmaceutic...",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/C62A7NIjLf-senior-general-service-officer"
    },
    {
        "title": "Project Exhibition Guide",
        "company": "GCL Energy Investments Limited Ethiopian Branch",
        "about": "The Project Exhibition Guide is responsible for providing informative, engaging, and professional guidance to visitors attending the project exhibition. They will assist in the smooth operation of the event by presenting project details, answering questions, and ensuring a positive experience for all attendees. This role requires a blend of communication, customer service, and exhibition knowledge to effectively showcase projects and their significance.Key responsibilityConduct daily reception and guided tours f...",
        "location": "Somali",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/JjQoOXgRQw-project-exhibition-guide"
    },
    {
        "title": "Tender & Bid Specialist (Construction, Trade, Motors & Transport)",
        "company": "Evolve Import Export and Construction",
        "about": "Job SummaryWe are seeking an experienced Tender &amp; Bid Specialist to manage the end-to-end tender process across our diversified business operations, including:Tender &amp; Bid Specialist(Construction, Trade, Motors &amp; Transport)Location: Evolve import and export CompanyDepartment: import and export and marketingEmployment Type: Full-timeReporting To: Import and Export and Marketing Department Head Construction projects (government/private contracts),Import, Export &amp; sale of goods (procurement tenders)...",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/bUJJtuI2e2-tender-bid-specialist-construction-trade-motors-transport"
    },
    {
        "title": "Facility Manager – Assosa",
        "company": "Pharo Integrated Agriculture and Manufacturing PLC",
        "about": "Job Summary: The Facility Manager leads the overall management of the organization’s physical infrastructure and workplace services. This role ensures operational reliability through preventive and corrective maintenance while also overseeing vendor management, safety, regulatory compliance, waste management, sustainability efforts, and space planning.Key Responsibilities:Preventive &amp; Corrective Maintenance: Develop and manage maintenance schedules for all building systems (e.g., HVAC, electrical, plumbing, ...",
        "location": "Benishangul Gumuz",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/a4YuVKpK3g-facility-manager-assosa"
    },
    {
        "title": "Senior Secretary",
        "company": "Evolve Import Export and Construction",
        "about": "Job SummaryOur multi-sector business seeks a detail-oriented and efficient Secretary to provide comprehensive administrative and documentation support. The role combines traditional secretarial tasks (filing, correspondence, scheduling) with cross-functional coordination to ensure smooth operations across diverse business units.Key expected Responsibilities1. Core Secretarial DutiesManage the calendar, appointments, and travel arrangements.Type, format, and proofread business documents (reports, memos, presentat...",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/zMslRaJJcP-senior-secretary"
    },
    {
        "title": "Procurement Officer",
        "company": "Aser Construction PLC",
        "about": "Aser Construction PLC is looking for a qualified candidate for the following position.Employment Type;For indefinite periodPlace of work ;Head OfficeSalary; Attractive and Negotiable / Road Construction industry experience is Advantageous/ ",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/V50MuDigZm-project-equipment-administration-head"
    },
    {
        "title": "Contract Engineer",
        "company": "Aser Construction PLC",
        "about": "Aser Construction PLC is looking for a qualified candidate for the following position.Employment Type;For indefinite periodPlace of work ;Head OfficeSalary; Attractive and Negotiable / Road Construction industry experience is Advantageous/ ",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/27ieMV22w6-contract-engineer"
    },
    {
        "title": "Project office Engineer Head",
        "company": "Aser Construction PLC",
        "about": "Aser Construction PLC is looking for a qualified candidate for the following position.Employment Type;For indefinite periodPlace of work ;Project SitesSalary; Attractive and Negotiable / Road Construction industry experience is Advantageous/ ",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/pqmqbRoahU-project-office-engineer-head"
    },
    {
        "title": "Engineering Department Manager",
        "company": "Aser Construction PLC",
        "about": "Aser Construction PLC is looking for a qualified candidate for the following position.Employment Type;For indefinite periodPlace of work ; Head OfficeSalary; Attractive and Negotiable / Road Construction industry experience is Advantageous/ ",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/8E7uHdPazD-engineering-department-manager"
    },
    {
        "title": "Cashier/Receptionist",
        "company": "KADISCO General Hospital",
        "about": "General Duty and Responsibility:The Cashier/Receptionist is responsible for providing exceptional customer service while accurately processing patient payments and handling financial transactions within the hospital. This role requires a high level of attention to detail, excellent communication skills, and the ability to work effectively in a fast-paced healthcare environment. The Cashier/Receptionist is often the first financial point of contact for patients, so a positive and helpful attitude is essential.Key...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/AyZWKtLWCc-cashierreceptionist"
    },
    {
        "title": "Senior Accountant",
        "company": "FEEL CONSTRUCTION PLC",
        "about": "JOB TITLE: AccountantCAREER LEVEL: SeniorCATEGORY: FinanceEMPLOYMENT TYPE: PermanentLOCATION: Addis AbabaSALARY (Optional): NegotiableJOB DESCRIPTIONFEEL Construction is a General Contractor Construction Company that is engaged in building construction and road construction works. Accordingly, our company is seeking eligible and qualified applicants for the position listed below.MAIN DUTIES AND RESPONSIBILITIESFinancial Reporting: Preparation of financial statements such as Balance Sheet, Income Statement, Cash ...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/YMmSMbu8LU-senior-accountant"
    },
    {
        "title": "Accountant",
        "company": "Cheshire Ethiopia",
        "about": "Job Title:AccountantWork Unit: Finance and Procurement DirectorateImmediate Supervisor:  Finance Team LeaderJob Summary: - Under the overall guidance of the Finance Team Leader the Accountant will process and reconcile a wide variety of accounting documents such as invoices, billing, cash receipts, journal vouchers, review and code financial information, prepare and process documents to disburse funds, make deposits and prepare reports, compile and review information for accuracy, maintain records and responsibl...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/Bpoqcz7nhs-accountant"
    },
    {
        "title": "Senior Accountant",
        "company": "Haron Computers",
        "about": "TheSeniorAccountantwilloverseethefinancialoperationsofHaronComputersanditssister companies,ensuringaccuracyandcompliancewithlegalstandards.Thisrolewillplayakeypartin managingthefinancialdata,assistinginaudits,taxfilings,costaccounting,andbudgetmanagement whilealsomentoringjuniorstaff.TheSeniorAccountantwillberesponsibleforreportingdirectlytotheFinanceManagerandcollaboratingcloselywiththeCost/BudgetHeadandGeneralAccountsHead.",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/RENC9jd1OS-senior-accountant"
    },
    {
        "title": "Watsan Infrastructure Team Leader",
        "company": "Solidarités International",
        "about": "We are seeking a Watsan Infrastructure Team Leader for the opening of our base in Motta. You’ll play a crucial role in coordinating a team ofWATSAN infrastructure officers in order to set up the WASH hardware activities, ensuring that Solidarités International technical recommendations and procedures are followedwith the guidance of the Deputy Program Coordinator – WASH and Field Coordinator.Setting up the activities /control and supervisionPlan the weekly activities for his/her team and have them approved by hi...",
        "location": "Amhara",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/2NvsxKCV3I-watsan-infrastructure-team-leader"
    },
    {
        "title": "Logistics Supervisor",
        "company": "Solidarités International",
        "about": "We are seeking a Logistics Supervisor for the opening of our base in Motta. As such, you will be essential in ensuring smooth and efficient operations across our base, working closely with the Logistician and Field Coordinator. You’ll manage everything from procurement and vehicle fleets to IT support and stock control, maintaining vital supply chains and supporting field activities.Management of suppliesUpdate price lists and vendor databasesControl Solidarités International purchase proceduresVerify and proces...",
        "location": "Amhara",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/pYikBaCZ18-logistics-supervisor"
    },
    {
        "title": "Administrative Supervisor",
        "company": "Solidarités International",
        "about": "We are seeking an Administrative Supervisor for the opening of our base in Motta. As such, you’ll play a crucial role in supporting the base’s financial and HR functions, managing basic accounting operations, payroll, and personnel administration with the guidance of the Administrator and Field Coordinator. You’ll handle essential tasks such as recruitment support, onboarding, contract management, and payroll processing, ensuring compliance with policies. Additionally, you’ll manage cash flow, prepare monthly ac...",
        "location": "Amhara",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/BWrS2EzqRb-administrative-supervisor"
    },
    {
        "title": "MEAL Supervisor",
        "company": "Solidarités International",
        "about": "We are seeking a skilled Monitoring, Evaluation, Accountability, and Learning (MEAL) Supervisor to join our team. This role involves supporting the development and implementation of monitoring and evaluation (M&amp;E) processes, ensuring data integrity and quality, and contributing to report writing and data analysis. Key responsibilities include overseeing data management, providing technical support to the program team, and ensuring compliance with accountability protocols. The MEAL Supervisor will also play a...",
        "location": "Amhara",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/UG8cP3OHCR-meal-supervisor"
    },
    {
        "title": "Market Analyst",
        "company": "KAKI PLC",
        "about": "KAKI PLC is an official dealer and assembler of ISUZU vehicle in Ethiopia. It is also engaged in different business lines including import, export, metal fabrication, after sales services, and cargo freight transport operations. The company wishes to employ a qualified professional for theMarket Analyst position.General Duties and Responsibilities:Plan, and conduct market intelligence activities that involve collecting information aboutthe company’s market – trends, competitors, and customer monitoring; and anal...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/v2TKevArit-market-analyst"
    },
    {
        "title": "Marketing Executive",
        "company": "Truluv Trading Plc",
        "about": "Employer-TruLuv Granola (TruLuv Trading PLC)Role-Marketing ExecutiveLocation- Addis AbabaTerms-Full-TimeSalary- As per company scaleDescription- TruLuv Granola is an artisanal all-natural snacks company based out of Addis Ababa, Ethiopia. We are a dynamic female-led business started in 2016, that makes healthy snacks made with ingredients we aim to sustainably source from local smallholder farmers and that are crafted by Ethiopian women.Position SummaryWe’re looking for a creative and energetic Marketing Executi...",
        "location": "Addis Ababa",
        "deadline": "August 15th, 2025",
        "url": "https://ethiojobs.net/job/P63G2T2j6E-marketing-executive"
    },
    {
        "title": "Junior Accountant",
        "company": "Addis Economic Research PLC",
        "about": "BackgroundAddis Economic Research (AER) is a research consulting firm based in Addis Ababa, Ethiopia. AER is actively engaged in undertaking a wide range of economic research aimed at informing better policy and decision-making. AER provides three major services: research and data analysis, survey management, and capacity building. To date, AER has completed various studies for a broad spectrum of national and international stakeholders. AER is composed of professional economists and social science experts with ...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/q7Af6XNjPH-junior-accountant"
    },
    {
        "title": "Assistant",
        "company": "Ethiopian National Association of the Blind",
        "about": "Ethiopian National Association of the Blind (ENAB)DescriptionEthiopian National Association of the Blind (ENAB) is the first Organization for Peoples with disabilities in Ethiopia. Since its establishment, ENAB works more than 65 years for the realization of the right for people with Visual impairments. ENAB is collaborating and networking with many local and international organizations towards this objective. ENAB would like to announce vacant position forAssistant and hire competent applicant.Position: Assista...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/01DDM8atGr-assistant"
    },
    {
        "title": "Call for Service Providers: Development, Production, and Broadcasting of Radio Programs and PSAs on Women, Peace, and Security (WPS)",
        "company": "TIMRAN",
        "about": "BackgroundTIMRAN is a non-partisan, women-led civil society organization working to enhance women’s participation in Ethiopian politics and public decision-making. As part of its ongoing project \"Empowering Women’s Leadership in Emergency (WLiE)\", funded by CARE Ethiopia and implemented in Abala and Erebti woredas of the Afar Region, TIMRAN seeks to engage a qualified media house to produce and broadcast culturally relevant radio programs in the Afar language.ObjectiveTo develop and broadcast radio content that ...",
        "location": "Afar",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/PwsHDOzw7m-call-for-service-providers-development-production-and-broadcasting-of-radio-programs-and-psas-on-women-peace-and-security-wps"
    },
    {
        "title": "Assistant Manager",
        "company": "Society For Endocrinology and Metabolism of Ethiopia(SEME)",
        "about": "Society for Endocrinology and Metabolsim of Ethiopia (SEME) is a national medical society of physicians registered to practice in Ethiopia.For more information please refer to the following link; https://docs.google.com/document/d/18DL8IWeMQrhLQ4gG-bZclkPLbMFIWJYJ/edit?usp=sharing&amp;ouid=112871499205828425147&amp;rtpof=true&amp;sd=true",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/vbPKgR4Pry-assistant-manager"
    },
    {
        "title": "Logistics Assistant - Fleet",
        "company": "NRC (Norwegian Refugee Council)",
        "about": "Role and responsibilitiesThe following is a brief description of the role.Generic responsibilitiesAdhere to NRC policies, tools, handbooks and guidelinesEnsure that vehicles are used and maintained according to Logistics Handbook, other NRC policies and donor requirementsPlan, schedule and monitor transport of staff and material/equipment according to demands and proceduresEnsure that all NRC and hired vehicles are in proper operating condition, coordinate vehicle maintenanceManage drivers accordance to NRC logi...",
        "location": "Somali",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/JBMMkFRoX4-logistics-assistant-fleet"
    },
    {
        "title": "Consultancy service to provide Communication coordination and graphic design",
        "company": "SNV",
        "about": "Purpose of the AssignmentThe purposes of this assignment are:Implement the BRIDGE+ communication strategy by producing high-quality, audience-tailored content and ensuring its effective dissemination across appropriate channels to stakeholders, beneficiaries, partners, and the wider public.Ensure that all communication outputs adhere to SNV’s global communication standards, ethical guidelines, and visual identity principles.Develop and standardize communication templates and visual identities, ensuring consisten...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/hYgLgfHdU8-consultancy-service-to-provide-communication-coordination-and-graphic-design"
    },
    {
        "title": "Barber (Male & Female Services)",
        "company": "Tareq Sabt Construction",
        "about": "An experienced Barber is needed to provide modern grooming and hair styling services for both men and women. Candidates must have at least 2 years of experience, strong technical skills in haircutting, shaving, and styling, and maintain high hygiene standards. Certification in barbering or cosmetology is a plus.",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/WDoWBe9SJp-receptionist"
    },
    {
        "title": "Cloud Business Solutions Architect",
        "company": "Huawei Technologies Ethiopia PLC",
        "about": "Job Responsibilities:1. Conduct pre-sales research and diagnostic support for Huawei's public cloud, providing competitive solutions based on customer needs or pain points.2. Build technical capabilities for major projects, offering competitive horizontal or industry-specific solutions leveraging Huawei Cloud and ecosystem partner capabilities. Assist customers in selecting and designing cloud-native architectures, support POC validation, and ensure successful cloud migration of applications.3. Gain insights int...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/16OMsls6rg-cloud-business-solutions-architect"
    },
    {
        "title": "Graduate in Training",
        "company": "BGI Ethiopia",
        "about": "📢 Step into the Future: BGI Graduate Trainee Program 2025!🚀 Launch Your Career with BGI EthiopiaAre you a recent graduate eager to turn your potential into performance?Join our Graduate in Training (GIT) Program— a 12-month immersive journey designed to develop the next generation of leaders across our operations, marketing, supply chain, engineering, finance, and HR functions.This program is designed to empower emerging professionals especially women to thrive in dynamic business environments.🎓 What We Offer...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/1q7BPvKTEM-graduate-in-training"
    },
    {
        "title": "Senior Web and Visual Designer",
        "company": "Edge Communication Technology PLC",
        "about": "Position2 :SeniorWeband Visual Designer Location: Addis Ababa, Ethiopia Employment Type: Full-TimeDepartment:DesignandCreativeUnitJobSummary:EdgeCommunicationTechnologiesPLCislookingforacreativeanddetail-oriented Senior Web and Visual Designer who can design engaging and user-centric web anddigitalassets.Theidealcandidatewillworkcloselywithmarketing,engineering, andleadershipteamstocreatevisuallycompelling designsthatreflect our brand identity.KeyResponsibilities:Designmodern,responsive,andinteractivewebsitesCre...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/O5ELlKZJrn-senior-web-and-visual-designer"
    },
    {
        "title": "Digital Marketing Expert",
        "company": "Edge Communication Technology PLC",
        "about": "Position : Digital Marketing Expert Location:Addis Ababa, EthiopiaEmployment Type:Full-TimeDepartment: Marketing OperationsJobSummary:Wearelookingforanexperiencedandresults-drivenDigitalMarketingExperttojoinourteamatEdgeCommunicationTechnologiesPLC.Theideal candidatewilllead thedevelopmentandexecutionofdigitalmarketingstrategiesacrossallchannels, improve online visibility, and support lead generation and brand awareness objectives.KeyResponsibilities:Plan and execute digital marketing campaigns across social med...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/rBzK9rnmjC-digital-marketing-expert"
    },
    {
        "title": "Assistant General Manager",
        "company": "KAKI PLC",
        "about": "KAKI PLC is an official dealer and assembler of ISUZU vehicle in Ethiopia. It is also working in different business lines including import, export, metal fabrication, after sales services, and cargo freight transport operations. The company wishes to employ a qualified professional for the Assistant General Managerposition.General Duties and Responsibilities:He/She is responsible to provide assistance to the General Manager on managing strategicbusiness matters of the company. He/she receive, analyze, summarize ...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/FHLlKnELwJ-assistant-general-manager"
    },
    {
        "title": "Commercial and Strategic Partnerships Director/Manager_ Shega",
        "company": "Talent Search - Ethiojobs",
        "about": "About the CompanyShega is on a mission of elevating decision-making in Africa, starting with Ethiopia, through a data &amp; Intelligence platform that aggregates and contextualizes information, along with a Media &amp; Audience Ecosystem offering high-quality media and analysis driven content. We also provide Insights &amp; Advisory, merging market intelligence with local expertise forstrategic growth and social impact, and Agency Services to help brands and organizations connect with our expanding audience. By ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/zPni52TBhy-commercial-and-strategic-partnerships-directormanager-shega"
    },
    {
        "title": "Food & Beverage Cost Controller",
        "company": "Tareq Sabt Construction",
        "about": "Monitor F&amp;B costs and conduct regular inventory audits.Analyze consumption trends and suggest cost-saving strategies.Collaborate with purchasing and kitchen teams for efficient resource use.",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/ZitizG6DCg-food-beverage-cost-controller"
    },
    {
        "title": "Food & Beverage Manager",
        "company": "Tareq Sabt Construction",
        "about": "Oversee and manage the full F&amp;B operation, including restaurants, bars, and room service.Lead team performance, revenue generation, and customer satisfaction.Maintain high standards of quality, hygiene, and customer experience.",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/Nsebheuin2-food-beverage-manager"
    },
    {
        "title": "Managerial Assistant/Inventory Manager",
        "company": "Nano Technologies PLC",
        "about": "We are seeking a trustworthy, organized, and motivated individual to join our team in a position as inventory manager and managerial Assistant. The ideal candidate will be flexible and capable of handling both internal operations and external office-related tasks.Key Responsibilities:Storekeeping Duties:Receive, inspect, and record incoming goods and materials.Organize and maintain proper storage and inventory tracking.Issue materials based on requests and maintain accurate stock records.Monitor inventory levels...",
        "location": "Addis Ababa",
        "deadline": "August 12th, 2025",
        "url": "https://ethiojobs.net/job/JiRpqNG8kF-managerial-assistantinventory-manager"
    },
    {
        "title": "Procurement & Supply Chain Officer",
        "company": "Top Beverages Industries Trading",
        "about": "Key ResponsibilitiesProduct Receiving &amp; IssuingDocument handlingCoordination with Finance TeamStrong communication &amp; Negotiation SkillsGood Computer Literacy (Microsoft Office Suite +)Experience with ERP Systems is a plusExperience required: 2 Years and aboveSex Male / Female",
        "location": "Oromia",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/eMLtaNe1Dc-procurement-supply-chain-officer"
    },
    {
        "title": "Food and Beverage (F&B) Officer",
        "company": "Mullege PLC",
        "about": "Key Responsibilities:Supervise the daily operations of restaurants.Ensure staff deliver exceptional customer service and adhere to company standards.Assist in the training and scheduling of F&amp;B staff.Monitor inventory levels and support procurement processes.Ensure compliance with health, safety, and hygiene regulations.Coordinate with the kitchen team to ensure timely food delivery and presentation quality.Address and resolve guest complaints or issues related to food and beverage service.Assist in preparin...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/7sWU7OXd7C-food-and-beverage-fb-officer"
    },
    {
        "title": "Head of Base",
        "company": "Solidarités International",
        "about": "We are seeking a Head of Base for the opening of our base in Motta. As such, you’ll manage the smooth running of an SI operations base. You will support the Field Coordinator and CD in management of the base and in representing SI in dealingswith local authorities and contacts.You will also make sure of the security of SI’s teams and assets, and of respect for the organization's ethics and values.You may have some other responsibilities related to administrative and financial management, logistics management, pr...",
        "location": "Amhara",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/2MJAWJP2Vz-head-of-base"
    },
    {
        "title": "Secretary & Accountant",
        "company": "Bisrat Promotion PLC",
        "about": "Category:Accounting and Finance, Admin, SecretarialPosition:Secretary &amp; AccountantPlace of Work:Addis AbabaCareer Level:Mid-LevelEmployment Type:PermanentSalary: As per the Company scale/Negotiable/Number of Opening:1 (One)ResponsibilitiesA secretary accountant typically handles both administrative and basic accounting tasks.Their responsibilities includemanaging daily accounting tasks, maintaining financial records, and providing administrative support.This may involve tasks such as recording transactions, ...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/kPkkD6h0u1-secretary-accountant"
    },
    {
        "title": "Branding Officer",
        "company": "KAKI PLC",
        "about": "KAKI PLC is an official dealer and assembler of ISUZU vehicle in Ethiopia. It is also engaged in different business lines including import, export, metal fabrication, after sales services, and cargo freight transport operations. The company wishes to employ a qualified professional for the Branding Officer position.General Duties and Responsibilities:Responsibleforcreatingauniquebrandofthecompany,ensurebrandremainsrecognizable and exiting to customers, plan ways to promote and change the publicperception of bran...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/1ALcuDpW1v-branding-officer"
    },
    {
        "title": "Internet Promoter",
        "company": "META ZION TRADING PLC",
        "about": "High salary recruitment internet promotionJob ResponsibilitiesHandle customer consultation issues promptly through the Internet ;Good at English communication, patient and motivated. Have a certain ability to withstand pressure;Have high enthusiasm for work and strictly abide by company rules and regulations .Salary and BenefitsSalary: a net salary of 12,000, with bonuses provided separately.Benefits: statutory holidays, paid training, daily/weekly/monthly bonuses for outstanding employees , and holiday benefits...",
        "location": "Addis Ababa",
        "deadline": "August 15th, 2025",
        "url": "https://ethiojobs.net/job/tsI1lVIgZJ-internet-promoter"
    },
    {
        "title": "Purchaser",
        "company": "KMD Import & Export",
        "about": "Position : PurchaserRequired Skills/ AbilitiesManage and oversee the purchasing departmentOversee all aspects of the purchasing process, including ordering, purchasing, supplier management, shipping, and inventoryPurchase materials and equipment, develop vendor agreements, and establish relationshipsDevelop and maintain a database of suppliers, vendors, and contractorsMaintain appropriate filing systems for all documents, records, and reportsMaintain pricing policies and oversee the negotiation of vendor values ...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/5v21g8n4q6-purchaser"
    },
    {
        "title": "Senior Accountant",
        "company": "KMD Import & Export",
        "about": "Company ProfileEstablished in 2014 EC, KMD Import &amp; Export has engaged in Import, Export, and agricultural business.Job DescriptionOverview:We are looking for Senior Accountant to be responsible for manage the financial operation of our company. The ideal candidate will be possessed strong analytical skills, attention to deal, and a solid understanding of import, export and agricultural business transactions. This role offers flexibility and an opportunity to work with a dynamic team in a fast-paced environm...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/yK6IPSHmMC-senior-accountant"
    },
    {
        "title": "Climate Change Mitigation & Adaptation Officer",
        "company": "The Lutheran World Federation World Service - Ethiopia",
        "about": "About the Lutheran World Federation (LWF)We are a global communion of churches in the Lutheran tradition, living and working together for a just, peaceful, and reconciled world. LWF World Service is the humanitarian and development arm of the Lutheran World Federation. We are a widely recognized, international, faith-based organization working in over 20 countries. We seek to bring people of all backgrounds together in the common quest for justice, peace, and reconciliation in an increasingly complex and fragmen...",
        "location": "Oromia",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/T0G060xEDc-climate-change-mitigation-adaptation-officer"
    },
    {
        "title": "Digital and System Management Officer",
        "company": "CARE Ethiopia",
        "about": "I. Job SummaryA robust data management system, JEOP portal, is developed for the JEOP project in collaboration with ICT4D vendor. The portal is designed to automate and simplify key processes such as VBT, MBL, and payroll generation. Additionally, it automates the preparation of weekly and monthly commodity tracking reports. The JEOP portal benefits the program by enabling more timely tracking of commodity movements, improving the identification and tracking of program participants, enhancing data quality, and f...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/ogouO75mbF-digital-and-system-management-officer"
    },
    {
        "title": "FINANCIAL ADVISOR",
        "company": "HST Consulting PLC",
        "about": "HST is a knowledge company that provides services for clients across various industries.HST endeavors solve its clients’ business growth, operational, people, financial, tax, governance, risk, learning and compliance challenges with locally relevant solutions. As local professional service firm, HST offers best practices that fully considers its clients’ unique circumstances and the social, political and economic environment in which they are operating.HST ispoweredbyhighlyqualifiedandbestinclassmulti-disciplina...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/rBgQytMctc-financial-advisor"
    },
    {
        "title": "Accountant - MK Steel Manufacturing PLC (Female)",
        "company": "Talent Search - Ethiojobs",
        "about": "Company OverviewMK Steel Manufacturing PLC is a fast-growing manufacturer of steel products based in Teklehaimanot, Merkato, Ethiopia. We are committed to delivering high-quality products through innovation and operational excellence. As part of our expansion, we are looking for a dedicated and detail-oriented Accountant I to join our Finance team.Position SummaryThe Accountant I will be responsible for recording day-to-day financial transactions, preparing payroll and tax-related reports, and ensuring accurate ...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/aPD7E5KQAA-accountant-mk-steel-manufacturing-plc"
    },
    {
        "title": "Call Center & Outdoor Sales Officer",
        "company": "Elegance General Trading PLC",
        "about": "📢 Vacancy Announcement – Elegance General TradingElegance General Trading is hiring motivated and qualified individuals for the following positions:1. Call Center &amp; Outdoor Sales Officer – 20 positions availableMinimum Education: 12th grade complete and above📍 Work Location: Bisrate Gabriel, Adot Building💰 Salary: Based on company scale + commission for sales officers📆 Application Deadline:Starting July 17, 2025, applications will be accepted for 10 days.📞 For More Information: Call 0979063858Join our g...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/p6ICr7SZ2i-call-center-outdoor-sales-officer"
    },
    {
        "title": "Sen. Liaison Officer",
        "company": "Manufacturing Company",
        "about": "Duties &amp; ResponsibilitiesRelationship Management:Develop and maintain strong working relationships with government agencies, industry associations, and other external stakeholders at all levels.Proactively engage with Each Department Managers, MD &amp; GMs, identifying their needs and priorities and tailoring communication and activities accordingly.    Build and nurture trust and rapport with each department Managers, MD &amp; GMs through regular communication, meetings, and events.Communication &amp; Coord...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/nWINhHsrna-sen-liaison-officer"
    },
    {
        "title": "Reception",
        "company": "Edomias International PLC",
        "about": "Job Title:-ReceptionEdomias International PLC is a Human Resources outsourcing and recruitment firm serving Client for the Past 20 years.Job SummaryA receptionist istypically the first point of contact for visitors and callers, providing a welcoming and organized front desk presence while handling administrative tasks and facilitating communication.They manage the reception area, answer phones, schedule appointments, handle correspondence, and perform various clerical duties to support the overall efficiency of ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/gyGFlYL44t-reception"
    },
    {
        "title": "Education Thematic Sector Lead",
        "company": "Plan International Ethiopia",
        "about": "The OpportunityThis role is responsible for shaping and refining the country strategy through authoritative thematic input, ensuring alignment with global standards and local contexts. The incumbent will lead comprehensive needs assessments and situational analyses to inform evidence-based program design, while ensuring consistency and quality across all interventions. A key focus will be on driving high-quality proposal development and resource mobilization, identifying strategic funding opportunities, and cult...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/OAhD4b69qZ-education-thematic-sector-lead"
    },
    {
        "title": "Real Estate Sales Agent",
        "company": "Dream Space Reality Business Group",
        "about": "Dream Space Realty, a property developer based in Ethiopia, is looking for experienced female real estate agents to join our team. If you have a passion for real estate, a knack for building client relationships, and a desire to thrive in a dynamic market, we encourage you to apply.This is a full-time, permanent, on-site position with a salary plus commission structure.Job Type: On-site - Permanent (Full-time)Job Deadline: July 22, 2025Experience Level: JuniorJob DescriptionWe are seeking Female candidates with ...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/av7lVeIF2r-real-estate-sales-agent"
    },
    {
        "title": "Commercial Manager",
        "company": "Lovegrass Agro Processing",
        "about": "Role Overview:Lovegrass Agro-Processing Plc is seeking for an ambitious, eager-to-learn and talented Commercial Manager who want to take responsibility and accountability in actively build our company and brands. This role is crucial for ensuring the effective implementation of commercial strategies while managing day-to-day operations related to sales, marketing, and distribution. It involves overseeing recruitment, onboarding, systems management, and maintaining thorough reporting for overall commercial depart...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/q6jSdeYzPg-commercial-manager"
    },
    {
        "title": "Group Finance Manager",
        "company": "Lovegrass Agro Processing",
        "about": "Role OverviewWe are seeking a commercially sharp, execution-focusedGroup Finance Managerto lead the financial strategy and governance of a fast-growing FMCG company with vertically integrated operations across East Africa, the UK, and Europe. This is a hands-on role for a finance leader who understands both the complexity of emerging markets and the demands of global consumer product businesses.The Group Finance Manager will be a critical partner to the Managing Director, providing strategic insight while owning...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/HmJatbdGWi-group-finance-manager"
    },
    {
        "title": "Human Resource Manager",
        "company": "Ethio Impact Consulting",
        "about": "The Human Resource Manager will lead the development and execution of HR strategies that align with the company’s business goals. This role is responsible for managing all aspects of human capital, including talent acquisition, performance management, employee engagement, compensation, and compliance with Ethiopian labor lawDuties and Responsibilities:Develop and implement HR strategies aligned with the company’s business objectives.Advise senior management on human capital planning, organizational development, ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/FAykdb2H6e-human-resource-manager"
    },
    {
        "title": "After Sales Service Officer",
        "company": "Ethio Impact Consulting",
        "about": "The After Sales Service Officer is responsible for ensuring smooth and timely delivery of machinery and vehicles to customers, along with proper installation of attachments and completion of all related documentation. This role supports customer satisfaction by providing quality service, maintaining communication, and coordinating with internal teams to ensure efficient after-sales operations.Duties and Responsibilities:Assures proper installation of attachments to equipment such as snow wings, plows, rippers,...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/ewbDRG33by-after-sales-service-officer"
    },
    {
        "title": "Secretary",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/hVOYDHovaQ-secretary"
    },
    {
        "title": "COC Focal Person & Program Coordinator",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/E65OV9LOO4-coc-focal-person-program-coordinator"
    },
    {
        "title": "Senior Accountant",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/A7LiFgnFIE-senior-accountant"
    },
    {
        "title": "District HR Operations Team Leader for South West District at Bonga City",
        "company": "Dashen Bank S.C",
        "about": "District HR Operations Team Leader for South West District at Bonga CityDashen Bank is pleased to announce the following Vacancy.Vacancy DetailsVacancy Number: DB_EX/HO/001/25Vacancy Posting End Date: 27/07/2025Job SummaryDistrict HR Operations Team Leader is responsible for implementing the activities related to talent acquisition and on-boarding including recruitment, selection and orientation processes in order to attract and recruit right employees. The role involves ongoing quest to discover talent, build a...",
        "location": "South West Ethiopia People's Region",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/KxMp31Mu8Z-district-hr-operations-team-leader-for-south-west-district"
    },
    {
        "title": "Bid Announcement for Audit Service",
        "company": "Young Men’s Christian Association of Ethiopia (YMCA Ethiopia)",
        "about": "YMCA Ethiopia invites qualified audit firms to submit proposals for the following services:Annual financial and performance audits for FY 2025Project-specific audits for FY 2025 (as required)About YMCA EthiopiaEstablished in 1947, theYoung Men’s Christian Association of Ethiopia (YMCA Ethiopia) is one of the oldest youth development organizations in Ethiopia.YMCA Ethiopia is affiliated with the World Alliance of YMCAs and the African Alliance of YMCAs.It has been re-registered by Authority for Civil Society Orga...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/KOSW9uZsBT-bid-announcement-for-audit-service"
    },
    {
        "title": "Finance Manager",
        "company": "Ethio Impact Consulting",
        "about": "The Finance Manager is responsible for overseeing all financial planning, budgeting, and reporting activities within the company. This role plays a critical part in ensuring cost control, effective cash flow management, detailed financial analysis, and regulatory compliance. The Finance Manager supports strategic decision-making processes to enhance profitability and collaborates closely with operations teams to drive efficiency and financial performance in a heavy industry setting.Duties and Responsibilities:Ma...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/MYQjHUnC46-finance-manager"
    },
    {
        "title": "Finance Manager",
        "company": "Anbessa Travel",
        "about": "JobVacancyAnnouncement:FinanceManagerAnbessa Travel is looking for an experienced Finance Manager to lead our ﬁnancial operations at AnbessaTravel.YouwillensurecompliancewithEthiopianGAAP/IFRS andtaxregulations,drivestrategicﬁnancialplanning,andoptimizeinternalcontrols. Your expertise will support sustainable growth through accurate reporting, risk management, and cross-departmental collaboration.KeyResponsibilitiesPrepareaccurateﬁnancialreportscompliantwithEthiopianGAAP/IFRSand ERCAstandards.Developandmonitorﬁn...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/GpLQrPEdkl-finance-manager"
    },
    {
        "title": "TVET Program Coordinator",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/UvGHrjcfuD-junior-accountant-job-description"
    },
    {
        "title": "Marketing & Sales Management Department Head",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/MNX5DDBdGl-marketing-sales-management-department-head"
    },
    {
        "title": "Chief Plant Operation Officer",
        "company": "Ethio-Asian Industries S.C",
        "about": "Production Planning and ControlCollaborate with the production team to develop and implement production schedules that meet customer demand while minimizing costs.Monitor production processes to ensure efficiency, quality, and compliance with safety and environmental standards.Identify and resolve bottlenecks in production to improve throughput and reduce lead times.Technical and MaintenanceOversee technical operations to ensure the maintenance and optimization of manufacturing equipment and processes.Ensure com...",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/AEXwfwmrZT-chief-plant-operation-officer"
    },
    {
        "title": "Marketing & Sales Management Instructor",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/aDcPLXMD9w-marketing-sales-management-instructor"
    },
    {
        "title": "Junior Sales Engineer - Agricultural Machinery and Equipment",
        "company": "Hagbes Private Limited Company",
        "about": "Prepare and deliver technical presentations explaining products or services to existing and prospective customers,Communicate with customers and engineers to assess equipment needs and to determine product requirements ,Organizes bid documents as per the bidder requirement ,Participates and follow up in the annual order plans ,Responsible for the day to day email , telephone communications and all paper works ,Organizes the office documentationParticipate on promotional events (exhibition) do necessary promotion...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/XvCPyfGaW0-junior-sales-engineer-agricultural-machinery-and-equipment"
    },
    {
        "title": "Purchaser  for Ultimate Motors",
        "company": "Hagbes Private Limited Company",
        "about": "Collaborate with internal stakeholders to understand their purchasing needs and requirements.Identify potential suppliers and obtain price quotations, samples, and product specifications.Negotiate terms and conditions with suppliers to ensure favorable pricing, delivery schedules, and quality standards.Place purchase orders with approved suppliers and follow up to ensure timely delivery of goods or services.Maintain accurate records of purchasing transactions, including purchase orders, invoices, and s...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/MmFnTjbSOp-purchaser-for-ultimate-motors"
    },
    {
        "title": "Driver",
        "company": "ALBANJAR FOREIGN EMPLOYMENT AGENCY",
        "about": "About Us:Established in 2012, Al Mawarid Manpower Solutions Company is a leading recruitment firm in the Kingdom of Saudi Arabia. We provide innovative staffing solutions to both private and public sectors, ensuring our clients can focus on their core business activities while we manage their human resources needs.Job Summary:We are seeking a reliable and experienced Driver to join our team. The ideal candidate will possess a valid Kingdom of Saudi Arabia driving license, have over one year of driving experience...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/76UA9pNXR4-driver"
    },
    {
        "title": "Call for Expression of Interest for Legal Service Provision",
        "company": "ACTION AGAINST HUNGER",
        "about": "Call for Expression of Interest for Legal Service ProvisionAction Against Hunger is an international non-profit humanitarian organization implementing relief, rehabilitation and development programs in different parts of Ethiopia Since 1985. Action Against Hunger has been registered with the Federal Democratic Republic of Ethiopia, charities and Societies under registration No. 0032.Currently Action Against Hunger has a total staff of 680 and it is expanding program operations through working in partnership with...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/FalMjGnJAJ-call-for-expression-of-interest-for-legal-service-provision"
    },
    {
        "title": "ReDSS Policy and Learning Coordinator",
        "company": "Danish Refugee Council",
        "about": "Danish Refugee Council, one of the world’s leading humanitarian NGOs, is currently looking for a highly qualified ReDSS Policy and Learning Coordinatorfor our operations in Addis Ababa, Ethiopia.About the jobThe Regional Durable Solutions Secretariat (ReDSS), established in 2015, is a secretariat of 14 NGOs that serves as a coordination and information hub to drive durable solutions for displacement-affected communities in the East, Horn, and Great Lakes regions of Africa. ReDSS enhances joint learning, informs ...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/e8QvG8pUhd-redss-policy-and-learning-coordinator"
    },
    {
        "title": "Junior Physiotherapist",
        "company": "Axon Neurology Specialty Center plc",
        "about": "Job Summary:Axon Physiotherapy is seeking passionate and dedicated Junior Physiotherapists to join our growing team. The ideal candidates will be recent graduates or professionals with up to 4 years of experience, eager to develop their clinical skills and provide high-quality patient care in a supportive environment.Key Responsibilities:Assess patients’ physical conditions and develop personalized treatment plans.Administer physiotherapy treatments (manual therapy, exercise therapy, electrotherapy, etc.).Monito...",
        "location": "Addis Ababa",
        "deadline": "August 17th, 2025",
        "url": "https://ethiojobs.net/job/NjMHic0EDs-junior-physiotherapist"
    },
    {
        "title": "Nursing Department Head",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/371pMdbfou-nursing-department-head"
    },
    {
        "title": "Library Assistant",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/n5i72AfJSN-library-assistant"
    },
    {
        "title": "Registrar Assistant",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/CizE7kLGNX-registrar-assistant"
    },
    {
        "title": "Pharmacy Instructor",
        "company": "National Aviation College",
        "about": "Internal/ External Vacancy AnnouncementNational Aviation Collegeis an authorized private higher education institute that is engaged in the provision of aviation related college programs. Further, with the authorization of the FDRE Education and Training Authority (ETA), the college provides different undergraduate, post graduate and distance learning Programs in Accounting and Finance, Marketing Management, Hotel Management, Aviation Management, Pharmacy and Comprehensive Nursing. Currently, the College is seeki...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/7LbapDqRsM-pharmacy-instructor"
    },
    {
        "title": "Junior Field Sales Representative",
        "company": "Holland Dairy P.L.C",
        "about": "A Junior Field Sales Representative with a commercial background. Someone with the ability to build strong relationships with agents, mini-distributors and outlets in a short time period, a good business acumen and analytical skills.Ability to gather insights and execute surveys with an eye for detail and data accuracy.Responsible for taking the targeted number of surveys per week from mini-distributors and their outlets. This will allow the company to map the value chain in the indirect channel. The focus will ...",
        "location": "Somali",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/J731iCxbnJ-junior-field-sales-representative"
    },
    {
        "title": "International Procurement Manager",
        "company": "GS Construction Company",
        "about": "Job Announcement-International Procurement ManagerPosition Title: International Procurement ManagerLocation: Juba, South SudanDepartment: Procurement &amp; LogisticsReporting To: Technical ManagerRole SummaryOur company is seeking a highly experienced and qualified International Procurement Manager to lead and coordinate the acquisition of materials, equipment, and services from overseas suppliers. This role is vital in ensuring timely, cost-effective, and quality procurement of critical inputs for our construct...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/Eig7eNc0l6-international-procurement-manager"
    },
    {
        "title": "Senior Accountant",
        "company": "Total Tech Solution Provider PLC",
        "about": "Job Overview:We are seeking an experienced and detail-oriented Senior Accountant to join our finance team on a permanent basis. The successful candidate will be responsible for managing general ledger activities, performing reconciliations, ensuring the accuracy of financial records, and supporting month-end and year-end closing processes. This role plays a vital part in maintaining the integrity of our financial data and supporting timely, accurate financial reporting.Senior Accountant – Duties and Responsibili...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/xm84xsaNvo-senior-accountant"
    },
    {
        "title": "Logistics and Transport Officer",
        "company": "Boortmalt Ethiopia P.L.C",
        "about": "The Logistics and Transport Officer is responsible for managing the end-to-end movement, storage, and distribution of goods, ensuring timely delivery and optimized supply chain operations. This role plays a critical function in route planning, transportation coordination, inventory tracking, and logistics reporting. The officer will work closely with internal teams, suppliers, carriers, and warehouse staff to support the company's supply chain effectiveness.1. Supply Chain CoordinationManage the flow of goods fr...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/zszaJnEOkd-logistics-and-transport-officer"
    },
    {
        "title": "Senior Sales Specialist",
        "company": "Moyee coffee Rosting plc",
        "about": "About Moyee Coffee:Moyee Coffee Roasting Plc is the first multinational coffee roasting company based in Ethiopia and a pioneer in FairChain coffee. As a fully integrated company—from crop to cup—we handle everything from growing to roasting coffee locally. We export premium roasted coffee to international markets and supply top-tier hotels and leading supermarkets across Ethiopia.Position Summary:The Senior Sales Specialist will be responsible for expanding our market presence by increasing revenue from key cli...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/PidaumMHgs-senior-sales-specialist"
    },
    {
        "title": "Sales and Marketing Manager",
        "company": "Moyee coffee Rosting plc",
        "about": "About Moyee Coffee:Moyee Coffee Roasting Plc is the first multinational coffee roasting company based in Ethiopia and a pioneer in FairChain coffee. As a fully integrated company—from crop to cup—we handle everything from growing to roasting coffee locally. We export premium roasted coffee to international markets and supply top-tier hotels and leading supermarkets across Ethiopia.Position Summary:The Sales and Marketing Manager will lead Moyee Coffee’s sales and marketing efforts across all business lines, incl...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/OYTu5pcxhU-sales-and-marketing-manager"
    },
    {
        "title": "Technical Consultant",
        "company": "Total Tech Solution Provider PLC",
        "about": "Position Summary:We are seeking a Technical Consultant who will play a vital role in delivering tailored technology solutions that solve real business problems for our clients. This role is responsible for providing end-to-end technical consulting, from requirements analysis and system configuration to integration, deployment, and post-implementation support of ERP, CRM, and other enterprise systems.The ideal candidate combines technical depth, hands-on development experience, strong communication skills, and a ...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/f81bh4Tejq-technical-consultant"
    },
    {
        "title": "Functional Consultant",
        "company": "Total Tech Solution Provider PLC",
        "about": "Position Overview:We are looking for a dynamic Functional Consultant to join our growing team at Total Tech Solution Provider PLC, a leading provider of software and hardware solutions. In this role, you will be the vital link between client business needs and our technical solutions, ensuring smooth implementation, configuration, training, and support of ERP and SCM systems. You will play a key role across the full solution lifecycle: from pre-sales and requirement gathering through go-live and post-deployment ...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/AnQ2h9nBcg-functional-consultant"
    },
    {
        "title": "Chief Auto Mechanic",
        "company": "GS Construction Company",
        "about": "Chief Auto MechanicLocation: Juba, South SudanKey Responsibilities:Supervise repair, servicing, and maintenance of vehicles, construction equipment, and batching plant machineryLead mechanical teams and allocate tasks based on expertise and urgencyDiagnose engine, transmission, hydraulic, and pneumatic systemsDevelop preventive maintenance schedules and report performance trendsEnsure availability of tools, spare parts, and workshop efficiencyCoordinate with procurement and logistics to support technical needs",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/982nB6ohTG-chief-auto-mechanic"
    },
    {
        "title": "Electrical Engineer BMS Operator for Addis Ababa",
        "company": "Dashen Bank S.C",
        "about": "Electrical Engineer BMS Operator for Addis AbabaDashen Bank is pleased to announce the following Vacancy.Vacancy DetailsVacancy Number: DB_EX/HO/002/25Vacancy Posting End Date: 28/07/2025Job SummaryElectrical Engineer BMS Operator plans, organizes and performs activities related with operation and management of electrical and mechanical equipment’s. S/he is responsible controlling proper functioning of all electrical installations, elevator, fire alarm, HVAC equipments &amp; all electrical fixtures located in He...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/MSyzBR2L5j-electrical-engineer-bms-operator-for-addis-ababa"
    },
    {
        "title": "Auto Electrician",
        "company": "GS Construction Company",
        "about": "GS Construction Company Ltd.We are currently seeking two skilled and experienced professionals to join our technical team. If you have a proven track record in heavy construction equipment maintenance and are ready for new responsibilities, we encourage you to apply.Position Auto ElectricianLocation Juba, South SudanKey Responsibilities:Perform electrical diagnostics and repair on heavy vehicles, construction machinery, and batching plant systemsMaintain electrical systems including wiring, lighting, ignition, a...",
        "location": "Addis Ababa",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/YGttJALPYZ-auto-electrician"
    },
    {
        "title": "TERMS OF REFERENCE FOR CONSULTANCY",
        "company": "American Friends Service Committee",
        "about": "PEACE AND SECURITY TRENDS IN THE HORN OF AFRICA (HOA): HARNESSING YOUTH AGENCY FOR PEACEBUILDING IN THE REGION1.0 ContextThe Horn of Africa continues to face recurring violent conflict, political instability, and fragile peace. In countries like Sudan, South Sudan, Somalia, Ethiopia, Kenya and Uganda, women and youth are often the most disproportionately affected by cycles of violence. Years of conflict in the region have resulted in deaths, injuries, destruction, loss of livelihoods, and displacement of populat...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/3uhumQPk5Y-terms-of-reference-for-consultancy"
    },
    {
        "title": "Driver Mechanic and Liaising Assistant",
        "company": "Marie Stopes International Ethiopia",
        "about": "Under immediate supervision of the Senior Fleet Manager at the Support office, the Driver Mechanic and Liaison, drives vehicles, ensures that the vehicle is in good working condition, keeps the tools safely, keeps the vehicle clean and presentable, and ensures the timely annual inspection and road-worthiness certificate acquisitions, records daily movement mileages. Assist in the collection of Performa invoices on an approved purchase requisition as required and handle liaising works with Government Offices and ...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/WzoYwbcq32-driver-mechanic-and-liaising-assistant"
    },
    {
        "title": "Tele Marketer",
        "company": "Dream Space Reality Business Group",
        "about": "Dream Space Realty, a property developer based in Ethiopia, is looking for experienced FEMALE Telemarketers for real Estate to join our team. If you have a passion for real estate, a knack for building client relationships, and a desire to thrive in a dynamic market, we encourage you to apply.This is a full-time, Contractual, on-site position with a salary plus commission structure.Job Type: On-site - Permanent (Full-time)Job Deadline: July 22, 2025Experience Level: JuniorJob DescriptionWe are seeking Female can...",
        "location": "Addis Ababa",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/lNnM9eEQEN-tele-marketer"
    },
    {
        "title": "Secretary",
        "company": "Tuba Commercial Investment PLC",
        "about": "Our organization Tuba Commercial Investment PLC looking for competent applicants for the vacant position who full fill under mentioned criteriaTitle of position: SecretaryRequired number: 1Salary:Attractive",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/PeC0qf7ktN-secretary"
    },
    {
        "title": "Head, General manager office /executive secretary/",
        "company": "Tuba Commercial Investment PLC",
        "about": "Our organization Tuba Commercial Investment PLC looking for competent applicants for the vacant position who full fill under mentioned criteriaTitle of position: Head, General manager office /executive secretary/Required number: 1Salary:Attractive",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/Kx4mUDF5pS-head-general-manager-office-executive-secretary"
    },
    {
        "title": "Junior Accountant",
        "company": "Tuba Commercial Investment PLC",
        "about": "Our organization Tuba Commercial Investment PLC looking for competent applicants for the vacant position who full fill under mentioned criteriaTitle of position: Junior Accountant Required number: 1Salary:Attractive",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/0l98CqLL3F-junior-accountant"
    },
    {
        "title": "Internal auditor",
        "company": "Tuba Commercial Investment PLC",
        "about": "Our organization Tuba Commercial Investment PLC looking for competent applicants for the vacant position who full fill under mentioned criteriaTitle of position: Internal auditorRequired number: 1Salary:Attractive",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/086H9kp4Ed-internal-auditor"
    },
    {
        "title": "Corporate Finance head",
        "company": "Tuba Commercial Investment PLC",
        "about": "Our organization Tuba Commercial Investment PLC looking for competent applicants for the vacant position who full fill under mentioned criteriaTitle of position: Corporate Finance headRequired number: 1Salary:Attractive",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/gK6wCH2DKB-corporate-finance-head"
    },
    {
        "title": "Scrub Nurse(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/d5eMBeIciN-scrub-nurse"
    },
    {
        "title": "ICU and Critical care Nurse(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/3cBcO4HZdT-icu-and-critical-care-nurse"
    },
    {
        "title": "Matron(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/vR0FkszBOJ-matron"
    },
    {
        "title": "OR Assistant Nurse",
        "company": "Teklehaimanot General Hospital",
        "about": "Teklehaimanot General Hospital is a private hospital providing multidisciplinary quality health care services with affordable price. You are invited to join the hospital on the following position:Employment type: PermanentSalary: - As per Company Scale ",
        "location": "Addis Ababa",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/yYQUhSmlFf-or-assistant"
    },
    {
        "title": "Market Developer",
        "company": "Holland Dairy P.L.C",
        "about": "Market Research &amp; Expansion:Identify potential new markets, retailers, and distributors for Holland dairy products.Conduct surveys and competitor analysis to understand market trends.Sales &amp; Business Development:Approach local retailers, supermarkets, and food-service providers to promote Holland dairy products.Build and maintain relationships with existing and potential clients.Achieve monthly sales targets as assigned.Customer Engagement &amp; Support:Provide product information, pricing, and promotion...",
        "location": "Sidama",
        "deadline": "August 20th, 2025",
        "url": "https://ethiojobs.net/job/s7IbAqUKfM-market-developer"
    },
    {
        "title": "Planning, Monitoring And Evaluation Service Head",
        "company": "Etab Soap Factory",
        "about": "External Vacancy AnnouncementETAB Soap Factory would like to hire committed, highly motivated and competent professional for the following vacant positions.sex: M/Fsalary: Negotiable location: Hawassa   Expected Skills:To be high Performance achiver in his /her/stayCapable enough to pass decision with respect to the organization’s rules &amp; regulationsAble to make continuation of the Company’s Vision &amp; starategic planEnergetic enough to possess good leadership &amp; inspired to bring changeExperience in a ...",
        "location": "Sidama",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/ynlWDrVKoo-planning-monitoring-and-evaluation-service-head"
    },
    {
        "title": "System Administrator",
        "company": "Get-As International PLC",
        "about": "Position Title: System AdministratorLocation: Addis AbabaEmployment Type: Full-timeAbout Us:Get-As International Plc. is a dynamic organization engaged in Real estate, Trading and Cross border transport. We are seeking a motivatedSystem Administratorto join our dynamic team.Job Summary:TheSystem Administratoris responsible for the configuration, administration, and support of the organization'sserver infrastructure,domain services, andenterprise directory systems. The role ensures stable, secure, and scalable sy...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/mN5vqulBoY-system-administrator"
    },
    {
        "title": "Key Account Manager",
        "company": "Transsion Manufacturing PLC",
        "about": "1. Develop and maintain strong, long-term relationships with key clients, including Ethio Telecom and Safaricom, acting as the main point of contact and trusted advisor.2. Understand clients’ business needs and provide tailored solutions to enhance partnership value.3. Maintain regular communication with clients and internal teams to strengthen relationships, proactively address issues, and ensure the timely delivery of solutions.4. Identify opportunities for upselling, cross-selling, and account growth within e...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/f4xdKMHzh6-key-account-manager"
    },
    {
        "title": "Property Administration Manager",
        "company": "Get-As International PLC",
        "about": "Position Title: Property Administration ManagerLocation: Addis AbabaEmployment Type: Full-timeAbout Us:Get-As International Plc. is a dynamic organization engaged in Real estate, Trading and Cross border transport. We are seeking a motivatedProperty Administration Manager to join our dynamic team.Job Summary:We are seeking an experienced and proactive Property administration Managerwhooversees the day-to-day operations of a property or portfolio of properties, ensuring they are well-maintained, financially sound...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/svFPZZbJOB-property-administration-manager"
    },
    {
        "title": "Project Implementation Unit (PIU) Manager- Re-advertised",
        "company": "National Bank of Ethiopia",
        "about": "Request for Expression of Interest(Consulting Services – Individual Consultant Selection)Country: The Federal Democratic Republic of EthiopiaNAME OF PROJECT: Financial Sector Strengthening ProjectProject ID: ______________________CONSULTING SERVICES:Project Implementation Unit (PIU) Manager - Individual ConsultantCredit No.: IDA V3780The Federal Democratic Republic of Ethiopia has received financing from the World Bank toward Financial Sector Strengthening Project and it intends to apply part of the proceeds for...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/ulwDUaUvWj-project-implementation-unit-piu-manager-individual-consultant-re-advertised"
    },
    {
        "title": "Network Administrator",
        "company": "Get-As International PLC",
        "about": "Position Title: Network AdministratorLocation: Addis AbabaEmployment Type: Full-timeAbout Us:Get-As International Plc. is a dynamic organization engaged in Real estate, Trading and Cross border transport. We are seeking a motivatedNetwork Administratorto join our dynamic team.Job Summary:TheNetwork Administrator is responsible for the daily operations, performance, and security of the organization’s networking systems. This includes configuring and maintaining network hardware and software, ensuring reliable and...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/dev9LntMe0-network-administrator"
    },
    {
        "title": "Financial Management Specialist - Re-advertised",
        "company": "National Bank of Ethiopia",
        "about": "Request for Expression of Interest(Consulting Services – Individual Consultant Selection)Country: The Federal Democratic Republic of EthiopiaNAME OF PROJECT: Financial Sector Strengthening ProjectProject ID: ______________________CONSULTING SERVICES:Financial Management Specialist- Individual ConsultantCredit No.: IDA V3780The Federal Democratic Republic of Ethiopia has received financing from the World Bank toward Financial Sector Strengthening Project and it intends to apply part of the proceeds for consulting...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/yRGEf3hoIe-financial-management-specialist-re-advertised"
    },
    {
        "title": "Local Procurement Manager",
        "company": "Get-As International PLC",
        "about": "Position Title: Local Procurement ManagerLocation: Addis AbabaEmployment Type: Full-timeAbout Us:Get-As International Plc. is a dynamic organization engaged in Real estate, Trading and Cross border transport. We are seeking a motivatedLocal Procurement Manager to join our dynamic team.Job Summary:We are seeking an experienced and proactive Local procurement Managerwhooversees the process of acquiring goods and services for an organization, ensuring cost-effectiveness, quality, and timely delivery. He or she mana...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/EXMwzRz7iP-local-procurement-manager"
    },
    {
        "title": "General Service & Facility management Head",
        "company": "Get-As International PLC",
        "about": "Job Title:General Service &amp; Facility management HeadLocation: Addis AbabaJob Type: Full-timeAbout Us:Get-As International Plc. is a dynamic organization engaged in Real estate, Trading and Cross border transport. We are seeking a motivated General Services and Facilities Management Head to join our dynamic team.Job Summary:The General Services and Facilities Management Head is responsible for overseeing all aspects of facilities management, general services, and workplace support across the organization. Thi...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/QvR25eMGOg-general-service-facility-management-head"
    },
    {
        "title": "BSC Nurse",
        "company": "Mahibere Hiwot for Social Development (MSD)",
        "about": "Internal/External Vacancy AnnouncementBackgroundMSD is a non-profit, civic society organization founded in 1999 to combat the HIV/AIDS epidemic. Since then, MSD works to strengthen the socio-economic development of the wider community, and the nation at large. Working with partners and stakeholders, MSD advance the voice of citizens and community structures in service delivery, identifying priority needs, provide support and services to target groups with education, skills, and promoting opportunities to get alo...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/VytcFWvrkp-bsc-nurse"
    },
    {
        "title": "Call Center Agent",
        "company": "Get-As International PLC",
        "about": "Job Title: Call Center AgentLocation: Addis AbabaJob Type: Full-timeRequired Person: 4About Us:Get-As International Plc. Is a dynamic Organization engaged in Real estate, Trading and Cross border Transport. We are seeking a motivated Call Center Agent to join our dynamic team.Key Responsibilities:Take customer calls and provide accurate, satisfactory answers to their queries and concernsDe-escalate situations involving dissatisfied customers, offering patient assistance and supportCall clients and customers to i...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/aQZHo1C24c-call-center-agent"
    },
    {
        "title": "Accountant",
        "company": "Cadila Pharmaceuticals (Ethiopia) PLC",
        "about": "Cadila Pharmaceuticals (India) is integrated Healthcare Solutions provider driven by “The passion to innovate to Life”, enjoying more than 60 years of Healthcare heritage worldwide with Regulatory Approvals from USFDA, MHRA, TGA, MCC, and WHO. The company is rapidly expanding its global matrix both in terms of manufacturing facilities and market reach.Cadila Pharmaceuticals (Ethiopia) P.L.C, a Joint Venture Company between Cadila Pharmaceuticals Limited, India and Almeta Impex P.L.C, Ethiopia, put up a Pharmaceu...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/3lJM5W6OgK-accountant"
    },
    {
        "title": "Shift Supervisors",
        "company": "Alvima Foods Complex PLC",
        "about": "Alvima Foods Complex Plc. invites applicants who fulfill the following qualification and experience requirements to apply for the following vacant position.Position: Flour Production Shift Supervisors Required manpower: 1(One)Salary: NegotiableType of employment: Permanent after probation periodWork place: Adama",
        "location": "Oromia",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/9WywNp24n8-shift-supervisors"
    },
    {
        "title": "Project Office Manager",
        "company": "Medical Teams International",
        "about": "Medical Teams International holds strict child and vulnerable adult safeguarding principles and a zero-tolerance policy for misconduct related to sexual harassment, exploitation and abuse in the workplace and other places where the organization’s activities are rendered. Parallel to technical competence, recruitment &amp; selection, hiring decisions will give due emphasis to assessing candidates' eligibility thorough background checks, police clearance, and professional reference check processes.JOB SUMMARY The ...",
        "location": "Not Specified",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/NihNgZDZ4M-project-office-manager"
    },
    {
        "title": "Program Coordinator",
        "company": "Civil Society Resource Center",
        "about": "Program Coordinator- Central Ethiopia(Urgent Recruitment)Civil Society Resource Centre (CSRC)Position Title: Program CoordinatorReports to: Executive DirectorLocation: Based in Central Ethiopia Project Office, with frequent travel within the regionEmployment Type: Full-timeProgram: EU Civil Society Fund Plus (CSF+) ProgramAbout CSRCThe Civil Society Resource Centre (CSRC) is an independent, non-profit organization dedicated to strengthening civil society in Ethiopia through capacity building, knowledge generatio...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/v4HbhEznQ8-monitoring-and-evaluation-officer"
    },
    {
        "title": "Monitoring and Evaluation Officer",
        "company": "Civil Society Resource Center",
        "about": "Position Title: Monitoring and Evaluation OfficerReports to: Program ManagerLocation: Addis Ababa, Ethiopia (With frequent travel to project implementation areas)Employment Type: Full-timeAbout CSRCThe Civil Society Resource Centre (CSRC) is an independent, non-profit organization dedicated to strengthening civil society in Ethiopia through capacity building, knowledge generation, policy dialogue, and advocacy support.Position SummaryCSRC is seeking a qualified and motivated Monitoring and Evaluation (M&amp;E) O...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/0rAK8M4DVx-monitoring-and-evaluation-officer"
    },
    {
        "title": "Senior SBCC Advisor",
        "company": "The Fred Hollows Foundation - Ethiopia",
        "about": "The Senior Social &amp; Behavioral Change Communication (SBCC) Advisor will provide strategic and technical leadership in the design, implementation, and evaluation of SBCC Strategies that contribute to the elimination of trachoma and the promotion of sustainable WASH practices.This role supports FHF’s integrated SAFE strategy (Surgery, Antibiotics, Facial cleanliness, and Environmental improvement), ensuring that communication interventions are evidence-based, culturally relevant, and targeted to promote lastin...",
        "location": "Addis Ababa",
        "deadline": "August 9th, 2025",
        "url": "https://ethiojobs.net/job/S0U7GxesJQ-senior-trachoma-and-wash-sbcc-advisor"
    },
    {
        "title": "Zonal Program Coordinator",
        "company": "Imagine1day International Organization",
        "about": "Vacancy: Internal/externalJob title:Zonal Program CoordinatorReports to:Imagine 1 Day Regional Program ManagerDuty station: West Omo zone (based at Jemu), and Konso zone + South Omo zone (based at Turmi)Employment condition: contract for one Year with the possibility of extensionsNumber of positions:Two (2)SALARY: As per the organization's salary scaleJob Overview:The TaRL Program Coordinator will be responsible for providing strategic direction and vision to the Education programming and will be responsible for...",
        "location": "South Ethiopia Regional State",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/VvFeuYh6nx-zonal-program-coordinator"
    },
    {
        "title": "Grants and Finance Officer",
        "company": "Civil Society Resource Center",
        "about": "Position Title: Grants and Finance OfficerReports to: Finance and Administration Unit CoordinatorLocation: Addis Ababa, Ethiopia (with frequent travel to project implementation areas)Employment Type: Full-timeAbout CSRCThe Civil Society Resource Centre (CSRC) is an independent, non-profit organization working to strengthen civil society in Ethiopia through capacity building, research, policy engagement, and advocacy support. CSRC implements the EU Civil Society Fund Plus (CSF+) Program, which aims to strengthen ...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/0oPj0bJNlf-grants-and-finance-officer"
    },
    {
        "title": "Digital Channel Officer",
        "company": "Ahadu Bank S.C",
        "about": "Ext/Vaca/0111/2025A Digital Channel Officer is responsible for managing and optimizing an organization's digital presence and communication channels to achieve business objectives. This role focuses on enhancing customer experience, driving engagement, and promoting products or services through various digital platforms. Key responsibilities include developing and implementing digital strategies, managing online content, analyzing digital metrics, and collaborating with various teams to ensure a consistent brand...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/I2lBdcEVjs-digital-channel-officer"
    },
    {
        "title": "Electrician",
        "company": "Access Bio",
        "about": "ABE produces and sells RDT (rapid diagnostic test) kits, COVID, Malaria, HIV, Dengue test kit.",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/XxXex5B5Qh-electrician"
    },
    {
        "title": "HR and Admin Officer",
        "company": "Access Bio",
        "about": "ABE produces and sellsMalariaRDT (rapid diagnostic test) kits, HIV test kit.Place of Work: Addis AbabaSalary:Gross 10,000 birr",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/Rc8jkNFVdY-hr-and-admin-officer"
    },
    {
        "title": "Secretary Cashier",
        "company": "Heritage Academy",
        "about": "Heritage Academy is a visionary early childhood education institution established in Lideta Sub-City, Addis Ababa. Anchored in the belief that “every child blossoms” in a nurturing environment, the academy is set to provide a holistic, inclusive, and high-quality kindergarten program that supports young learners' cognitive, emotional, social, physical, and moral development. The Kindergarten is looking for competent &amp; able candidates for the following positions who meet the following requirements.Salary; Att...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/erTSqrVrnS-secretary-cashier"
    },
    {
        "title": "School Nurse",
        "company": "Heritage Academy",
        "about": "Heritage Academy is a visionary early childhood education institution established in Lideta Sub-City, Addis Ababa. Anchored in the belief that “every child blossoms” in a nurturing environment, the academy is set to provide a holistic, inclusive, and high-quality kindergarten program that supports young learners' cognitive, emotional, social, physical, and moral development. The Kindergarten is looking for competent &amp; able candidates for the following positions who meet the following requirements.Salary; Att...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/jcwBmLFVcA-school-nurse"
    },
    {
        "title": "Consultancy service for short documentary video and photography",
        "company": "ZOA",
        "about": "Consultancy service for short documentary video and photographyProject Title: Integrated Multi-Sector Emergency Response to Populations Affected by Conflict and Violence in Benishangul GumuzLocation: Bulen and Debate Woredas, Metekel Zone, Benishangul Gumuz Region, EthiopiaDuration: 20 working days (including fieldwork, editing, and final submission)Assignment OverviewZOA Ethiopia is seeking a qualified media consultant or firm to produce a short documentary video and a high-quality photo book that visually capt...",
        "location": "Benishangul Gumuz",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/re6LZGrWLB-consultancy-service-for-short-documentary-video-and-photography"
    },
    {
        "title": "Assistant Technical Manager",
        "company": "MADOT COMPUTER SOLUTION PVT. LTD. CO.",
        "about": "Description:Job Title: Assistant Technical ManagerJob Type: Permanent (Full-time)Work Location: Addis Ababa, EthiopiaSalary: NegotiableDeadline: 5/08/2025Quantity: 3Description:Implement, develop, and maintain projects and software frameworks or toolsBuild, configure, and modify computer hardware and software; integrate systems, software, and hardware for enterprise-wide applicationsDevelop, maintain, and support databases and data warehousesSupport databases and data warehouses with data integrity, performance,...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/Mv9EeSssBY-assistant-technical-manager"
    },
    {
        "title": "Sales and Marketing Manager",
        "company": "Kubik Ethiopia",
        "about": "Job SummaryThe Sales &amp; Marketing Manager will play a pivotal role in Kubik’s growth by designing and executing strategic initiatives that drive revenue, market positioning, and long term brand value. This role is responsible for leading market expansion, building a high performing sales force, and positioning Kubik as a category leader in sustainable construction solutions. The manager will work closely with senior leadership to translate impact into commercial advantage while developing scalable, data-drive...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/qp3ShDYDXZ-sales-and-marketing-manager"
    },
    {
        "title": "Executive Director",
        "company": "Mekdim Ethiopia National Association (MENA)",
        "about": "JOB TITLE:Executive DirectorLocation:Addis Ababa (Head of Office)Job Type:Full TimeDEPARTMENT:Executive Director’s OfficeREPORTS TO:Board of DirectorsI. JOB SUMMARYThe Executive Director (ED) serves as the principal legal representative of Mekdim Ethiopia National Association (MENA) and is responsible for providing strategic direction and overseeing the organization's overall functions. This role ensures operational efficiency and aligns activities with MENA's mission, goals, and objectives. The ED works closely...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/B72kpCki2G-executive-director"
    },
    {
        "title": "Operations Director",
        "company": "Kubik Ethiopia",
        "about": "Job SummaryThe Operations Director is responsible for overseeing all aspects of the company’s operations, ensuring that supply chain, production, R&amp;D, and safety processes are aligned with company goals and are running efficiently and effectively. This role reports directly to the CEO, playing a critical part in strategic planning, execution, and driving operational excellence across the business while contributing to the company's overall vision and strategic direction.Responsibilities Strategic &amp; Opera...",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/zOC7hAQ6cw-operations-director"
    },
    {
        "title": "Customer Service Manager I for Hawassa District, Delo Menna Branch",
        "company": "Dashen Bank S.C",
        "about": "Customer Service Manager I for Hawassa District, Delo Menna BranchVacancy DetailsVacancy Number: DB_EX/HD/001/25Vacancy Posting End Date: 30/07/2025Job SummaryThe Customer Service Manager I will support the Branch Manager in coordinating all activities of Customer Service Officers (Maker/Checkers) and Senior Customer Service Officer (Cash/Accounts) within the Branch and ensure operational excellence to deliver exemplary services for high customer satisfaction levels, supporting the Bank’s growth.",
        "location": "Oromia",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/pDjH2edkyC-customer-service-manager-i-for-hawassa-district-delo-menna-branch"
    },
    {
        "title": "TOR Audit Firm",
        "company": "JaRco Consulting PLC",
        "about": "JaRco Consulting – TOR for Audit firmOrganizational BackgroundJaRco Consulting is a leading international consulting firm based in Addis Ababa, Ethiopia, specializing in Monitoring, Evaluation, and Learning (MEL). We work across diverse technical sectors including agriculture, livelihoods, health, nutrition, gender, and capacity development. Our clients include international donors, NGOs, UN agencies, and private sector actors. We are currently seeking a dynamic and experienced Business Development Manager to he...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/M0XKNCO7qA-tor-audit-firm"
    },
    {
        "title": "Income Auditor",
        "company": "Hilton Addis Ababa",
        "about": "General DescriptionAs an Income Auditor, you will monitor all transactions as they contribute to or detract hotel revenue.Specific Responsibilities:Carry out daily checks of revenue via an Operations Audit as per hotel standardsReconcile and monitor commissions, housekeeper and rate discrepancies, and Conference and Banqueting Revenue against daily function sheetsCheck non-arrivals, late departures, no sales/voids, management bills, bill sequence and pay-outsCheck bills signed to Room Account and record all ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/i1ytfCPB6O-income-auditor"
    },
    {
        "title": "Junior QA Engineer",
        "company": "Shega Media and Technology PLC",
        "about": "About ShegaShega is on a mission of elevating decision-making in Africa, starting with Ethiopia, through a data &amp; Intelligence platform that aggregates and contextualizes information, along with a Media &amp; Audience Ecosystem offering high-quality media and analysis driven content. We also provide Insights &amp; Advisory, merging market intelligence with local expertise for strategic growth and social impact, and Agency Services to help brands and organizations connect with our expanding audience. By combi...",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/4SudFEj2VC-junior-qa-engineer"
    },
    {
        "title": "Logistics, Admin and Finance Officer",
        "company": "Development Through Adult And Non Formal Education(DANFE)",
        "about": "SalaryAs per organization Salary scaleEmployment Condition1 Year of fixed contract term with possibility of additional extensions based on availability of fundsgovernmental and non-profit making organization established IN 2004 g.c and registered as per the new CSOs proclamation 1113/19. DANFE is mandated to operate in all regions and City Administration in Ethiopia. To meet its objectives DANFE calls for competent professionals to apply for the LAF Officerposition.Major DutiesThe LAF Officer of DANFE is will be...",
        "location": "Not Specified",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/2sLbZpHX1l-logistics-admin-and-finance-officer"
    },
    {
        "title": "RTM Specialist",
        "company": "United Beverages Share Company",
        "about": "Excellent Learning and Great Opportunities!!!Come work with United Beverages Ethiopia at a growing company that offers great benefits with opportunities to advance and learn alongside accomplished business leaders.Main ResponsibilityRTM Specialists are responsible to Coordinate Route to Market Activities to drive efficient and effective, sales distribution across all distribution locations.Responsibilities&amp; AccountabilitiesCoordinate and lead National RTM(Route to market) strategies.Ensure sales and distribu...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/qF9vp9N5Yn-rtm-specialist"
    },
    {
        "title": "Social Worker",
        "company": "Imagine1day International Organization",
        "about": "Job Title: Social WorkerDepartment: Child Protection in Emergencies (CPiE)Duty Station: South Ethiopia:- Meneti Shasha (Genet Era school), Beru (Gay school), Segen Zuria (Addis Gebra school), Bena Tsemay (Karkale School), and Dasench (Kuraze school and Merimarti school)Reports to: Child Protection Program OfficerEmployee condition:Contractfor One Year with possibility for renewalNumber of positions: - 6 (one each for the listed districts)Contract Type: Fixed-Term/Project-Based1. Job OverviewThe Social Worker wil...",
        "location": "South Ethiopia Regional State",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/2ADgXVemrV-social-worker"
    },
    {
        "title": "Technical Assistance Delivery Manager",
        "company": "Kifiya Financial Technologies",
        "about": "Market Solutions Practice (MSP)MSP corrects market failures by deploying Kifiya’s four core infrastructures—intelligent data &amp; decisioning, intelligent financial services, digital agriculture, and smart mobility—to enable MSMEs, smallholder farmers, and low-to-middle-income individuals to access finance and markets. Our work drives job creation, social inclusion, and economic empowerment, making us a partner of choice for impact funders.Program Overview: SAFEE Shared FacilityUnder the Sustainable Access to F...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/ICjdUest8F-technical-assistance-delivery-manager"
    },
    {
        "title": "Junior Accountant - ( Urgent )",
        "company": "Talent Search - Ethiojobs",
        "about": "Company OverviewOur Client is a leading global energy company specializing in the manufacturing and servicing of cutting-edge energy equipment. With a strong commitment to sustainability and innovation, play a pivotal role in advancing reliable, affordable, and clean energy solutions worldwide.Job OverviewWe are seeking a detail-oriented and proactive Junior Accountant to join our clients Finance team. The ideal candidate will have a foundational understanding of accounting principles, with specific experience i...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/aAMdpsG4wO-junior-accountant-urgent"
    },
    {
        "title": "Associate Researcher I – Bio analytical Laboratory Analyst",
        "company": "Armauer Hansen Research Inistitute(AHRI)",
        "about": "Transfer to the same Job Grade &amp; SalaryPermanent government employment through transferAssociate ResearcherI – Bio analytical Laboratory AnalystLocation: Addis Ababa, EthiopiaReports to: Director, Clinical Trials DirectorateEmployment Type and Duration: Full time employmentJob Grade: XVISalary: 12,765.00Home allowance: 6,000.00Mobile &amp; Internet allowance: 1,000.00Required Number: 2 (two)Background: The Armauer Hansen Research Institute (AHRI) was founded in 1970 through the initiative of the Norwegian an...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/5s7axfJpv5-associate-researcher-i-bio-analytical-laboratory-analyst"
    },
    {
        "title": "Education M&E  specialist",
        "company": "Development Through Adult And Non Formal Education(DANFE)",
        "about": "Employment Condition: 1 Year of fixed contract term with possibility of additional extensions based on the availability of fundsReport to Program ManagerSalary: as per organization Salary scaleDANFE Development through Adult and Non-Formal education (DANFE) is established July 2004 by the number of Volunteers who were dedicated to support vulnerable community groups in Addis Ababa. Since its establishment, it works both on Development and Humanitarian interventions. DANFE has been working in the area of Adult an...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/XCyNk1WMPQ-education-me-specialist"
    },
    {
        "title": "Disability inclusion Education officer",
        "company": "Development Through Adult And Non Formal Education(DANFE)",
        "about": "Employment Condition: 1 Year of fixed contract term with possibility of additional extensions based on the availability of fundsReport to Project coordinatorSalary: as per organization Salary scaleDevelopment through Adult and Non-Formal education (DANFE) is established July 2004 by the number of Volunteers who were dedicated to support vulnerable community groups in Addis Ababa. Since its establishment, it works both on Development and Humanitarian interventions. DANFE has been working in the area of Adult and ...",
        "location": "Not Specified",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/B0vSxaGrGG-disability-inclusion-education-officer"
    },
    {
        "title": "MEAL Officer",
        "company": "Marie Stopes International Ethiopia",
        "about": "Under the general administrative direction of the Area Manager, the MIS/IT Officer organizes a system of efficient data management and reporting system for area and field offices; supports the reporting systems of SRH/FP programs; leads and coordinates the electronic Health Management Information System (MIS) for clinics closely with the support office R, M&amp;E teams; provides technical support to the hardware and programs set up within the Area offices.",
        "location": "Not Specified",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/Tat9cZ76SC-meal-officer"
    },
    {
        "title": "Emergency Education officer",
        "company": "Development Through Adult And Non Formal Education(DANFE)",
        "about": "Employment Condition: 1 Year of fixed contract term with possibility of additional extensions based on the availability of fundsReport to Project coordinatorSalary: as per organization Salary scaleDevelopment through Adult and Non-Formal education (DANFE) is established July 2004 by the number of Volunteers who were dedicated to support vulnerable community groups in Addis Ababa. Since its establishment, it works both on Development and Humanitarian interventions. DANFE has been working in the area of Adult and ...",
        "location": "Not Specified",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/LNbxVqnaau-emergency-education-officer"
    },
    {
        "title": "Emergency Education Coordinator",
        "company": "Development Through Adult And Non Formal Education(DANFE)",
        "about": "Employment Condition: 1 Year of fixed contract term with possibility of additional extensions based on the availability of fundsReport to Program ManagerSalary: as per organization Salary scaleDevelopment through Adult and Non-Formal education (DANFE) is established July 2004 by the number of Volunteers who were dedicated to support vulnerable community groups in Addis Ababa. Since its establishment, it works both on Development and Humanitarian interventions. DANFE has been working in the area of Adult and Non-...",
        "location": "Not Specified",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/22mmssoVB9-emergency-education-coordinator"
    },
    {
        "title": "Nurse",
        "company": "Marie Stopes International Ethiopia",
        "about": "Under general supervision by the MSIE Centre Coordinator, Centre Head, Centre Manager/OPD, the incumbent performs nursing duties ensuring efficient delivery and client/patient care in accordance with accepted standard medical practice and professional codes of conduct.",
        "location": "Amhara",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/Heus8uKD86-nurse"
    },
    {
        "title": "Junior Accountant",
        "company": "YAFCO TRADING PLC",
        "about": "YAFCO Trading PLC are seeking a Junior Accountant for (Mattot Cafe).Junior AccountantKey ResponsibilitiesRecord daily sales (cash/card) and expensesPost journal entries for payments, receipts, payroll allocations, etc.Manage petty cash and reconcile daily cash tillsPrepare and submit monthly P&amp;L statements and variance analyses to the Chief AccountantGenerate weekly sales and cost reports for the Cafe ManagerTrack food &amp; beverage inventory levels and costsCalculate cost‑of‑goods‑sold (COGS) for menu item...",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/EhmxqXkSNY-junior-accountant"
    },
    {
        "title": "Finance and Admin Officer",
        "company": "Natanim Charitable Organization (NCO)",
        "about": "Vacancy Re-Advertisement: Finance and Admin OfficerPosted: July 22, 2025About UsNatanim Charitable Organization (NCO), registered on April 5, 2023, under Ethiopia’s Civil Society Organizations Proclamation No. 1113/2019 (Registry No. 6792), is dedicated to enhancing mental health, psychosocial support, and disability inclusion across Ethiopia. NCO collaborates with government offices, health and education institutions, NGOs, and Organizations of Persons with Disabilities (OPDs) to serve vulnerable communities, p...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/ZjSHwTlIpI-finance-and-admin-officer"
    },
    {
        "title": "Human Resource and Admin Officer",
        "company": "Medical Teams International",
        "about": "Work Days &amp; Hours:Monday-Saturday, 40-48 hours/week, occasional weekends and public holidaysTravel:Regular travel to field officesJOB SUMMARY  To provide the day-to-day MTI HR and Admin support in Amhara Field Office to ensure quality health care services for Refuge , internally displaced peoples and host community in Amhara Ethiopia. This position will be responsible for ensuring proper implementation of HR activities and assist in recruitment, benefits, performance management, and staff development.JOB RES...",
        "location": "Not Specified",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/X8Wa897Olq-human-resource-and-admin-officer"
    },
    {
        "title": "Materials Manager",
        "company": "Talent Search - Ethiojobs",
        "about": "Job OverviewWe are seeking a highly experienced Materials Manager to lead and oversee all aspects of materials management, including purchasing, inventory control, receiving, and distribution. This role is critical in ensuring cost-effective procurement, optimized stock levels, and internal service efficiency across departments. The successful candidate will manage a purchase volume of over ETB 200 million annually and supervise a team across stores, receiving and issuing operations.ResponsibilitiesOperational &...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/nwpUiM6sON-materials-manager"
    },
    {
        "title": "Sales Supervisor",
        "company": "Deluxe Properties",
        "about": "Deluxe propertiesare engaged in theReal Estate Business.Our Company is seeking eligible and qualified applicants for the position listed below.Main Responsibility &amp; DutiesTeam Leadership and Management:Supervise a team of Sales Consultants/Sales Representatives, ensuring they meet or exceed sales targets and contribute to the overall success of the internal sales division.Provide coaching, training, and development to team members, helping them improve their sales skills, product knowledge, and customer rela...",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/FjY0xLa6xl-sales-supervisor"
    },
    {
        "title": "RECEPTIONIST",
        "company": "Medecins Sans Frontieres-Belgium (MSF-Belgium)",
        "about": "Main PurposeReceive and transfer, according to standard protocols, incoming calls and visitors, to provide them with accurate information or alternative ways to obtain it.AccountabilitiesReceive and welcome visitors.Operate the telephone switchboard and deal with all incoming, outgoing and transferring calls.Provide general information and refer to all non-routine information to the supervisor.Update the telephone directory, record changes, and distribute updates as necessary.Distribute and handle all incoming a...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/V6LxRCMTVB-receptionist"
    },
    {
        "title": "IT Project Manager",
        "company": "BGI Ethiopia",
        "about": "We are looking for a dynamic IT Project Manager with a strong background in software development and experience managing complex technology projects. This role combines hands-on coding expertise—particularly in Microsoft Power Platform, .NET, and web technologies—with strong project leadership and stakeholder management skills. The ideal candidate is a tech-savvy problem solver who can write code, manage vendors, and ensure project outcomes align with organizational goals.Write clean, maintainable code and build...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/AYHqRngORl-it-project-manager"
    },
    {
        "title": "Logistics Operation Manager",
        "company": "BGI Ethiopia",
        "about": "Manage the end-to-end logistics operations across corporate multiple locations or business units the Company by strategizing, planning and optimizing transportation, distribution, and fuel inventory management activities and ensure efficient and cost-effective supply chain operations.Develop and implement corporate logistics strategies, policies, and procedures to align with organizational goals and objectivesCollaborate with senior management and other departments to understand business requirements and develop...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/5QxeGxhs8v-logistics-operation-manager"
    },
    {
        "title": "SENIOR ACCOUNTANT(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "ABOUTWASHINGTONHEALTHCAREWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/R9oibPR61o-senior-accountantreadvert"
    },
    {
        "title": "Pharmacist",
        "company": "Rank Family PLC",
        "about": "Company: Rank Specialized Dermatology ClinicPosition: Degree PharmacistEmployment Type: Full-time (6 months or more, permanent)Location: Addis Ababa – Gelead Pharmacy branches at Wolo Sefer &amp; LebuNumber of Vacancies: 2Salary: Monthly (Negotiable)Rank Specialized Dermatology Clinic is looking for experienced and dedicated pharmacists to join our team. Successful candidates will be placed at our pharmacy branches in Wolo Sefer and Lebu.",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/gVsTQjJEUW-pharmacist"
    },
    {
        "title": "Senior Export Officer",
        "company": "BGI Ethiopia",
        "about": "Coordinate and handle all export activities, including communication, documentation, customs clearance, and transportation arrangements by monitoring export transactions with existing and/or prospective export markets for all export products and assist to identify appropriate business opportunities and develop and maintain professional relationships with all clients and other stakeholders involved in the export transaction processes.Assist the Export Manager in developing strategic and operating export plans to ...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/LupWQMV6Aj-senior-export-officer"
    },
    {
        "title": "Graduate Trainee",
        "company": "Hijra Bank S.C",
        "about": "Duty stationAddis Ababa (All Branches)Central District (Wolkite, Werabe, Butajira, and its area)Central East District ( Adama, Asella, Arsi Robe, and its area)North West District (Bahir Dar, Gonder, Motta, Bichena, Benishangul, and its area)North District (Mekelle, Shire, Alamata, and its area)North East District (Dessie, Kombolcha, Logia, and its area)South East District (Shashamane, Bale, Halaba, Dilla, Hawassa, and its area)South West District (Jimma, Tepi, Gambela, Wollega, and its area)East District (Dire D...",
        "location": "Not Specified",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/RgqsYVfrri-graduate-trainee"
    },
    {
        "title": "JUNIOR ACCOUNTANT(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "ABOUTWASHINGTONHEALTHCAREWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/HRil9fvzWd-junior-accountantreadvert"
    },
    {
        "title": "Front Office Manager/Supervisor( Female)",
        "company": "Africana Real State",
        "about": "Front Office Manager/SupervisorRoles and Responsibilities:Oversee daily front office operations, ensuring efficient guest check-in/check-out.Manage and train reception staff, ensuring top-tier customer service standards.Handle guest complaints, special requests, and resolve issues promptly.Coordinate with housekeeping and other departments to ensure seamless operations.Prepare front desk schedules and ensure optimal staff coverage.Monitor room inventory and assist with reservations during high occupancy.Prepare ...",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/8FS8XvjiHt-front-office-managersupervisor-female"
    },
    {
        "title": "Receptionist (Female)",
        "company": "Africana Real State",
        "about": "Roles and Responsibilities:Greet guests warmly and professionally upon arrival.Handle check-ins/check-outs efficiently using hotel PMS (e.g., Opera).Manage reservations, cancellations, and room assignments.Answer phone calls, respond to emails, and handle guest inquiries.Ensure the lobby and reception area are presentable and welcoming at all times.Provide local and hotel information, assist with concierge services as needed.Maintain accurate guest records and process payments securely.Assist with administrative...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/y354scFbdm-receptionist-female"
    },
    {
        "title": "Area Sales Manager",
        "company": "East Africa Bottling Share Company - Coca Cola",
        "about": "An exciting vacant position has arisen at East Africa Bottling Share Company - Ethiopia for the role of Area Sales Manager. East Africa Bottling Share Company works with the world’s most cherished trademark; invests in the most sophisticated production system in the world and employ people who are prepared to work with passion and focus.The position is structured to report to the Regional Sales Manager and responsible to deliver volume and revenue growth by effectively managing the Sales team.Key duties and resp...",
        "location": "Not Specified",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/5YAaDdYNCK-area-sales-manager"
    },
    {
        "title": "Human Resources (HR) Officer",
        "company": "Mullege PLC",
        "about": "Key Responsibilities:Assist in recruiting processes: posting job ads, shortlisting candidates, and scheduling interviews.Support onboarding and orientation for new employees.Maintain and update employee records (physical and digital).Assist in preparing employment contracts, letters, and other HR documents.Handle employee inquiries on HR policies, leave balances, and general procedures.Monitor employee attendance, leave records, and timesheets.Support in organizing training sessions, performance appraisals, and ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/PwX8l8bowB-human-resources-hr-officer"
    },
    {
        "title": "Senior Accountant - Cost & Budget",
        "company": "Moti Engineering PLC",
        "about": "What We DoMoti Engineering PLC is an ICT Company established in 2006, engaged in the supply of banking automation machines, IT materials, and solutions to provide business support. Works aiming to create more customer satisfaction.We’re growing, innovative, specializing in banking services automation, and have executed a lot in payment solution technologies - from introduction, installation, and maintenance services. Highly qualified in ICTinfrastructure and networking projects execution and Management works.Cur...",
        "location": "Addis Ababa",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/sBoFHvLzg2-senior-accountant-cost-budget"
    },
    {
        "title": "Seinor Accountant",
        "company": "Mullege PLC",
        "about": "Key Responsibilities:Prepare and analyze monthly, quarterly, and annual financial statements.Reconcile account balances and bank statements.Maintain and update general ledger accounts.Oversee daily financial transactions including accounts payable/receivable, payroll, and fixed assets.Assist in budgeting, forecasting, and variance analysis.Ensure timely and accurate tax reporting and compliance with local, regional, and international regulations.Coordinate with external auditors and support audit processes.Devel...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/SNo5YNfw8D-sinor-accountant"
    },
    {
        "title": "IT Administrator  (Re-Advertisement)",
        "company": "Dashen Brewery Share Company",
        "about": "Job TitleIT Administrator (Re-Advertisement)LocationAddis AbabaNo. of Positions1Job summary:responsible for effective provisioning, installation/configuration, operation, and maintenance of systems hardware and software and related IT infrastructure.ResponsibilitiesHardware AdministrationInstalls new operating hardware compatible with all software applications.monitors operating hardware configuration to ensure data integrityCo-ordinate fine-tuning of the existing operating environment.Evaluate hardware system p...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/hwZeeQxcIj-it-administrator-re-advertisement"
    },
    {
        "title": "Brand Marketing and Sales Manager",
        "company": "Flipper International School PLC",
        "about": "Responsible for planning, developing, and implementing the Brand Marketing strategies, marketing communications, and public relations activities, both external and internal.To lead and manage the marketing and sales activities of the Brand across all its campuses and locations to position the brand optimally for growth and a superior reputation in the market.Responsible for ensuring that marketing and sales expertise/advice is delivered to the Managing Director, Regional Managing Director, Regional Marketing Dir...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/8swdAkQBLU-brand-marketing-and-sales-manager"
    },
    {
        "title": "Senior Sales",
        "company": "Gift Real Estate PLC",
        "about": "Key Responsibilities:Sales &amp; Business Development:Identify and pursue new business opportunities in residential, commercial, or industrial property markets.Generate leads, follow up on inquiries, and convert prospects into buyers or tenants.Present and promote properties to potential clients through site visits, presentations, and negotiations.Achieve or exceed monthly and quarterly sales targets.Property Administration:Manage and maintain accurate property listings, client databases, and transaction records...",
        "location": "Addis Ababa",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/pKCxibowSr-senior-sales"
    },
    {
        "title": "Junior Flight Operation Officer",
        "company": "Redsea Aviation Services Plc",
        "about": "Red Sea Aviation Services is a flight support company based in Addis Ababa Ethiopia. We provide comprehensive flight support, VIP airport services and concierge services. Our team of aviation experts work around the clock to ensure that our valued clients' inquiries and requests are handled with utmost care. We are committed to service excellence.This is a full-time, on-site role for junior flight operation officer at Red Sea Aviation Services. The incumbent will be responsible to: Handle day to day operations a...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/tyh5Iq53mg-junior-operations-officer"
    },
    {
        "title": "Performance Auditor",
        "company": "Ayat S.co",
        "about": "Conduct operational audits as outlined in the audit plan, focusing on key areas such as process efficiency, risk management, and control effectiveness.Evaluate business processes and operations, identifying potential areas of inefficiency, waste, and non-compliance.Review and analyse operational data, policies, procedures, and documentation and assess the adequacy of controls.Prepare thorough and well-documented audit workpapers that detail audit procedures, findings, and conclusions.Assist in drafting audit rep...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/gXQczvvOFL-performance-auditor"
    },
    {
        "title": "Sales Team Leader",
        "company": "Ahununu Trading PLC",
        "about": "We are looking for a dynamic and results-driven Sales Team Leader to lead and coordinate our sales team toward achieving strategic revenue and growth targets. The ideal candidate will have a strong background in B2B and B2C sales, with leadership capabilities to guide a growing team, develop sales strategies, and maintain high-performance standards.Key ResponsibilitiesLead, mentor, and motivate the sales team (Sales Officers and Coordinators) to meet and exceed targets.Develop and implement actionable sales stra...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/L9zWWpfjg8-sales-team-leader"
    },
    {
        "title": "Junior Officer – Import Department",
        "company": "PAUL RIES AND SONS ETHIOPIAN LIMITED COMPANY",
        "about": "Pual Ries and Sons LTD invites qualified &amp; competent applicant to the following position:-Contact person: -Employee Recruitment DepartmentTelephone: - 011-155-02-33/011-155-25-88Job Type: -Full timePlace of work: -Addis AbabaSalary:-NegotiableDead line: August 1, 2025Job Description:Assist in import documentation and shipping processesCoordinate with logistics companies and customs brokersFollow up with suppliers and track shipmentsMaintain proper records of import permits, invoices, and clearance papersSupp...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/mmXJ04TlVQ-junior-officer-import-department"
    },
    {
        "title": "FSMS Documentation Officer",
        "company": "Abays Trading PLC",
        "about": "Company’s and Role’s OverviewABYS Trading PLC is the leading Manufacturing Company of Ethiopia which manufactures agriculture products both for local and international markets. It has been active since 2011 and exports over 40 high quality value added agricultural products which meet world relevant standards to three main destination countries such as America, Canada and Australia and other locations. Moreover, it distributed such products to local market. Nowadays, in line with government trade, marketing and d...",
        "location": "Oromia",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/StP3lvNVAh-fsms-documentation-officer"
    },
    {
        "title": "Archive Manager",
        "company": "Talent Search - Ethiojobs",
        "about": "Company Summary:Established in 1997, this company is a major player in Ethiopia’s edible oil production, commodity exporting, and branded consumer goods distribution. It operates multiple business units, including a large-scale edible oil factory, a coffee export division, and a supply chain for oilseeds, pulses, and spices. The company also engages in equipment leasing and tender services, with operational centers across Ethiopia to ensure proximity to customers and suppliers. Committed to quality, reliability,...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/LMXM4uCPRl-archive-manager"
    },
    {
        "title": "Scrub Nurse(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/VefdxXD3zH-scrub-nursereadvert"
    },
    {
        "title": "ICU and Critical care Nurse(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/KBg0NaI8zG-icu-and-critical-care-nursereadvert"
    },
    {
        "title": "Recovery Nurse(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/iWCuMkfOaZ-recovery-nursereadvert"
    },
    {
        "title": "Junior Anesthetist(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutwashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/GYv2XXzGeY-junior-anesthetistreadvert"
    },
    {
        "title": "Financial Auditor",
        "company": "Ayat S.co",
        "about": "Conduct financial audits in accordance with the audit plan and established audit methodologies.Review and analyze financial statements, accounting records, and supporting documentation.Assess the adequacy and effectiveness of internal controls over financial reporting.Perform data analysis and identify discrepancies, trends, and potential areas of concern in financial records.Verify the accuracy and completeness of financial data through analytical procedures and substantive testing.Prepare clear and comprehensi...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/9CZv3tvG6w-financial-auditor"
    },
    {
        "title": "Secretary",
        "company": "PAUL RIES AND SONS ETHIOPIAN LIMITED COMPANY",
        "about": "Pual Ries and Sons LTD invites qualified &amp; competent applicant to the following position:-Contact person: -Employee Recruitment DepartmentTelephone: - 011-155-02-33/011-155-25-88Job Type: -Full timePlace of work: -Addis AbabaSalary:-NegotiableDead line: August 1, 2025Job Description:Provide high-level administrative support to the General ManagerManage the GM’s calendar, schedule meetings, and coordinate appointmentsPrepare agendas, take minutes, and follow up on action items from executive meetingsDraft pro...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/53AIzWu0K8-secretary"
    },
    {
        "title": "Office Engineer",
        "company": "Ayat S.co",
        "about": "Prepare, organize, and maintain project documentation, including drawings, specifications, contracts, and reports.File all project documents accurately and make them easily accessible for team members.Assist in the preparation and review of technical reports, project plans, and engineering drawings.Coordinate with engineers and construction teams and resolve technical issues and provide solutions.Track project progress and assist in the preparation of progress reports and status updates.Provide administrative su...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/3sP4jrCCu5-office-engineer"
    },
    {
        "title": "Junior Officer – Tender Department",
        "company": "PAUL RIES AND SONS ETHIOPIAN LIMITED COMPANY",
        "about": "Pual Ries and Sons LTD invites qualified &amp; competent applicant to the following position:-Contact person: -Employee Recruitment DepartmentTelephone: - 011-155-02-33/011-155-25-88Job Type: -Full timePlace of work: -Addis AbabaSalary:-NegotiableDescription:- August 1, 2025Dead line: August 1, 2025Job Description:Assist in preparing bid documents and proposal submissionsMonitor tender opportunities (newspaper, portals, etc.)Maintain tender filing systems and support documentationCoordinate with suppliers, depar...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/agyVem1OOj-junior-officer-tender-department"
    },
    {
        "title": "Senior Office Engineer",
        "company": "Ayat S.co",
        "about": "Prepare, organize, and maintain project documentation, including drawings, specifications, contracts, and reports.File all project documents accurately and make them easily accessible for team members.Assist in the preparation and review of technical reports, project plans, and engineering drawings.Coordinate with engineers and construction teams and resolve technical issues and provide solutions.Check that all engineering and construction activities comply with project specifications and regulatory requirements...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/QgB6Zd2oZS-senior-office-engineer"
    },
    {
        "title": "Marketer",
        "company": "Power Up Ethiopia PLC",
        "about": "Job Overview:We are seeking a dynamic Marketer with 1 to 3 years of relevant experience. The ideal candidate must be proficient in English (mandatory) and comfortable using platforms like Telegram and email for outreach, communication, and engagement. You will be responsible for supporting marketing initiatives, running campaigns, and assisting in the execution of marketing strategies.Key Responsibilities:Plan, execute, and optimize marketing campaigns via email and Telegram.Develop and maintain communication wi...",
        "location": "Addis Ababa",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/tZerpN2ki3-marketer"
    },
    {
        "title": "School Staff",
        "company": "Fountain of Knowledge School",
        "about": "Organization OverviewFountain of Knowledge School is one of the top schools in Addis Ababa teaching from Pre KG to grade 12. “Running for Excellence,” is the motto as well as the vision that we thrive to achieve. We disseminate modern education based on international standards and reflective of traditional core values.Position SummaryWe are looking for competent and committed staffs’ for who are passionate and dedicated. Qualified candidates are highly expected to discharge their duties with high standards of ex...",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/1SWzXycsvy-school-staff"
    },
    {
        "title": "Electrical Engineer",
        "company": "CCECC Ethiopian Branch",
        "about": "Job Title: Electrical EngineerLocation: Addis AbabaCompany: CCECC Ethiopian BranchEmployment Type: Full-time ContractApplication Deadline: August 24, 2025Number of Positions: 2 (1 for Power System Design, 1 for IT Network System Design)Salary: NegotiableJob Summary:CCECC Ethiopian Branch would like to hire competent applicants for the following vacant positions. We are searching for experienced Electrical Engineers to oversee the company’s new and ongoing construction projects at various phases. The successful c...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/qbmePBrv5m-electrical-engineer"
    },
    {
        "title": "RAP (Resources, Accounting, and Procurement) Officer",
        "company": "MERSA Media Institute",
        "about": "Position Title: RAP OfficerEmployment Type: Fixed TermDuration of Employment: 1 year with a possibility of extensionLocation: Addis Ababa, Ethiopia, mandatory occasional travelApplication Deadline: August 10, 2025Organizational Profile: MERSA Media Institute is a nonprofit media policy think tank. We work to help create vibrant, responsible, and independent media institutions, professional unions, and education centers through research, capacity building, and institutional support in Ethiopia.Position Summary: T...",
        "location": "Addis Ababa",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/xUwLjqRTKO-rap-officer"
    },
    {
        "title": "DevOps Engineer",
        "company": "Horra Corporate Group",
        "about": "About Hiring CompanyEverything starts from an idea. But every idea might not see the daylight of success without hard work and diligence. 15 years ago, Horra Trading was just an idea in the mind of Mr. Adem Kedir who meticulously worked day and night to turn it into a reality in 2005, basing himself on his extensive skill and knowledge in coffee and coffee trade. Mr. Adem Kedir’s coffee trade career started as the succeeding generation from his grandfather Mr. Abbahawa and his father Mr. Kedir Hadjji Hassan in E...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/sKdiK80nI1-devops-engineer"
    },
    {
        "title": "Presales Engineer",
        "company": "Horra Corporate Group",
        "about": "About Hiring CompanyEverything starts from an idea. But every idea might not see the daylight of success without hard work and diligence. 15 years ago, Horra Trading was just an idea in the mind of Mr. Adem Kedir who meticulously worked day and night to turn it into a reality in 2005, basing himself on his extensive skill and knowledge in coffee and coffee trade. Mr. Adem Kedir’s coffee trade career started as the succeeding generation from his grandfather Mr. Abbahawa and his father Mr. Kedir Hadjji Hassan in E...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/YxtHcNZZFp-presales-engineer"
    },
    {
        "title": "Nursing Activity Manager – Outreach Activities -KOREM - Re-Advertise",
        "company": "Medecins Sans Frontieres-Belgium (MSF-Belgium)",
        "about": "Main PurposeDefining, coordinating and monitoring all care and nursing related activities in the project and ensuring the daily management of the human resources, according to MSF nursing protocols, standards and pro-cedures, in order to warrant efficiency, quality and continuity of prescribed care.AccountabilitiesPlanning and organizing all nursing related activities (IPD, OPD, maternity, nutrition, etc.) and participating in the defini-tion of annual planning and update of its associated budget in order to eff...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/Fh40ALyaQZ-nursing-activity-manager-outreach-activities-korem-re-advertise"
    },
    {
        "title": "Foreman",
        "company": "Reality Construction & Real Estate",
        "about": "REALITY REAL ESTATE is a prominent player in the real estate development sector in Ethiopia. The company has focused on constructing high-quality residential apartments that meet the growing demands of urban living.Duty and Responsibilities:Prepares action Plan, implement and manage construction tasks in accordance with priorities and goals in consultation with immediate supervisor;Measures quality of works in meters, plumb bob, tamper( Riga), water level and verifies as work in progress with construction tools;...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/mxDJ5Qu77Y-foreman"
    },
    {
        "title": "Emergency Project Coordinator",
        "company": "Plan International Ethiopia",
        "about": "The OrganisationPlan International is an independent development and humanitarian organisation that advances children’s rights and equality for girls. We believe in the power and potential of every child but know this is often suppressed by poverty, violence, exclusion and discrimination. And it is girls who are most affected.Working together with children, young people, supporters and partners, we strive for a just world, tackling the root causes of the challenges girls and vulnerable children face. We support ...",
        "location": "Benishangul Gumuz",
        "deadline": "July 29th, 2025",
        "url": "https://ethiojobs.net/job/jIFZfueFbp-emergency-project-coordinator"
    },
    {
        "title": "Young Professionals (Pre-Service) Program",
        "company": "Ethiopian Insurance Corporation",
        "about": "WHAT WE DOEthiopian Insurance Corporation was founded in 1976 by Proclamation No. 68/1975, consolidating thirteen nationalized private insurance firms into today’s largest insurer in Ethiopia, offering comprehensive coverage through an extensive branch network. Following economic liberalization, it was reconstituted as a public enterprise in 1994 under Proclamation No. 201/94. EIC is currently undergoing an organizational transformation aimed at enhancing customer service improving responsiveness, reliability, a...",
        "location": "Addis Ababa",
        "deadline": "July 30th, 2025",
        "url": "https://ethiojobs.net/job/a5OmUgk2bq-young-professionals-pre-service-program"
    },
    {
        "title": "WASH Specialist",
        "company": "Plan International Ethiopia",
        "about": "The OpportunityThe position holder will provide overall scope-based technical direction on quality assurance and design of the WASH project and program development, including implementation, in line with Plan’s global Disaster Risk Management (DRM) policy and strategy. S/He ensures that quality emergency WASH program delivery is reflected within the entire project cycle and that all field program implementation is undertaken efficiently and effectively. The position holder supports the project/program humanitari...",
        "location": "Addis Ababa",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/7QrsMVdWlZ-wash-specialist"
    },
    {
        "title": "Truck Driver",
        "company": "Plan International Ethiopia",
        "about": "The OpportunityThis position requires close coordination with the drilling crew, Chief Driller, and logistics team to ensure the timely and accurate delivery of required materials. Additionally, the role may involve regular communication with community representatives, government officials, and other stakeholders to ensure smooth implementation.Please Click here review full Job DescriptionsSafeguarding Children and Young People (Safeguarding) and Gender Equality and Inclusion (GEI)Understands and puts into pract...",
        "location": "Gambela",
        "deadline": "August 24th, 2025",
        "url": "https://ethiojobs.net/job/4e7BlebT7T-truck-driver"
    },
    {
        "title": "Frontend Developer",
        "company": "Horra Corporate Group",
        "about": "About Hiring CompanyEverything starts from an idea. But every idea might not see the daylight of success without hard work and diligence. 15 years ago, Horra Trading was just an idea in the mind of Mr. Adem Kedir who meticulously worked day and night to turn it into a reality in 2005, basing himself on his extensive skill and knowledge in coffee and coffee trade. Mr. Adem Kedir’s coffee trade career started as the succeeding generation from his grandfather Mr. Abbahawa and his father Mr. Kedir Hadjji Hassan in E...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/qdKF8hhUdU-frontend-developer"
    },
    {
        "title": "TSFP Officer",
        "company": "Save the Children",
        "about": "TEAM/PROGRAMME: WFPLOCATION: Goro and Harana buluk woredasGRADE: 4ACONTRACTLENGTH: 5 monthsCHILDSAFEGUARDING:(select onlyone)Level 3: thepostholderwill have contact with childrenand/oryoung people eitherfrequently(e.g. oncea weekormore) orintensively(e.g. fourdaysin onemonth ormoreorovernight)becausethey work countryprograms; orare visiting countryprograms; or becausetheyareresponsiblefor implementing thepolice checking/vetting process staff.ROLE PURPOSE:The position holder is responsible for the TSFP implementa...",
        "location": "Oromia",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/0s4tXqg8rL-tsfp-officer"
    },
    {
        "title": "Mobile App Developer",
        "company": "Horra Corporate Group",
        "about": "About Hiring CompanyEverything starts from an idea. But every idea might not see the daylight of success without hard work and diligence. 15 years ago, Horra Trading was just an idea in the mind of Mr. Adem Kedir who meticulously worked day and night to turn it into a reality in 2005, basing himself on his extensive skill and knowledge in coffee and coffee trade. Mr. Adem Kedir’s coffee trade career started as the succeeding generation from his grandfather Mr. Abbahawa and his father Mr. Kedir Hadjji Hassan in E...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/447tVeNOBQ-mobile-app-developer"
    },
    {
        "title": "Sales Director",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Position SummaryWe are looking for a results-driven, visionary Sales Director with strong business acumen, deep knowledge of the Ethiopian market, and a proven track record in B2B technology sales. This role demands a highly strategic thinker who is also hands-on, able to negotiate at the highest levels, lead diverse teams, and drive revenue growth through well-designed and localized sales and marketing strategies.The ideal candidate will have extensive experience with strategic management tools such as the Bala...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/SerJ2gWyTw-sales-and-marketing-director"
    },
    {
        "title": "Mechanic Driver - Rig Maintenance Operator",
        "company": "Plan International Ethiopia",
        "about": "The OpportunityThis position aligns with Plan International’s core values and principles and is responsible for the proper operation and maintenance of the drilling rig, as well as the execution of all drilling activities using appropriate and approved methods.The Mechanic Driver – Rig Maintenance Operator plays a vital role in ensuring the effective operation, transportation, and maintenance of drilling rigs and support vehicles. The position supports both shallow and deep well drilling activities by operating ...",
        "location": "Gambela",
        "deadline": "August 23rd, 2025",
        "url": "https://ethiojobs.net/job/MInMNcRdvp-mechanic-driver-rig-maintenance-operator"
    },
    {
        "title": "Project Associate",
        "company": "Solidaridad",
        "about": "Solidaridad is a global civil society organization (CSO) that provides market-driven solutions for sustainable production practices across different supply chains. We envision a world in which all we produce, and all we consume, can sustain us while respecting the planet, each other, and the next generations. Our mission is to bring together supply chain players and engage them with innovative solutions to improve production, ensuring the transition to a sustainable and inclusive economy that maximizes the benef...",
        "location": "Amhara",
        "deadline": "August 19th, 2025",
        "url": "https://ethiojobs.net/job/yCom6X70n2-project-associate"
    },
    {
        "title": "Senior Accountant",
        "company": "VIV Beverages Manufacturing S.C",
        "about": "VIV BEVERAGES MANUFACTURING S.CVIV Beverages Manufacturing S.C is leading company in the alcoholic beverages sector producing high quality potable alcohol, variety alcoholic liquors and beer products. The plant (Factory) is located at Sheno / Semen Shoa zone which is 70 km from Addis AbabaJob title: Senior AccountantJob type : PermanenteWork place: Addis AbabaQualification: Bsc in Accounting and FinanceExperience: 5 years and aboveRequired quantity: 2Sex: Male/FemaleSalary: NegotiableResponsibilities include :re...",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/hScrD6DyOI-senior-accountant"
    },
    {
        "title": "Head Nurse for (AICU, NICU and Surgical Support Service)",
        "company": "KADISCO General Hospital",
        "about": "AICU Head NursePosition SummaryThe AICU Head Nurse is a senior-level registered nurse responsible for overseeing the operations, staffing, and clinical care provided in the Adult Intensive Care Unit. This role ensures the delivery of high-quality, patient-centered care while maintaining compliance with hospital policies, safety standards, and healthcare regulations.Key Responsibilities:Lead and manage nursing staff in the AICU, including scheduling, performance evaluations, and professional development.Ensure ad...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/kMBrhTbYdd-head-nurse-for-aicu-nicu-and-surgical-support-service"
    },
    {
        "title": "Procurement Officer",
        "company": "Tadesse Desta Import Export",
        "about": "Tadesse Desta Business Group (TDBG) is one of the seasoned and prominent Private companies in Ethiopia. It incorporates four legal business entities namely; Tadesse Desta Import and Export, Aztad Industrial and Trading PLC, Azeb Tadesse Coffee supplier, and TADAB under its umbrella. It engages in import/export, transport and manufacturing business.Tadesse Desta Business Group is looking for highly motivated &amp; qualified professional for the following positionsSalary: - Negotiable",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/zX25dKumPU-procurement-officer"
    },
    {
        "title": "Internal Auditor",
        "company": "Tadesse Desta Import Export",
        "about": "Tadesse Desta Business Group (TDBG) is one of the seasoned and prominent Private companies in Ethiopia. It incorporates four legal business entities namely; Tadesse Desta Import and Export, Aztad Industrial and Trading PLC, Azeb Tadesse Coffee supplier, and TADAB under its umbrella. It engages in import/export, transport and manufacturing business.Tadesse Desta Business Group is looking for highly motivated &amp; qualified professional for the following positionsSalary: - Negotiable",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/8cVFLk7hKl-internal-auditor"
    },
    {
        "title": "Marketing Manager",
        "company": "TIZITA AMARE RESTAURANT WITH LIQUOR LICENSE AND CAFETERIA",
        "about": "Position- Marketing Manager with accounting backgroundMain DutiesBudget Management : Ability to plan and manage Marketing and event budgets, ensuring cost-effectiveness and maximizing return on investment.Data-Driven Marketing: Leverages analytical skills from accounting to interpret customer data, forecast trends, and optimize campaigns.Social media marketingDrafting proposals and promotional materialsCustomer service via telephone, telegram, Email Communication: Acts as a bridge between marketing and finance d...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/GCsjduhyfp-marketing-manager"
    },
    {
        "title": "Liaison officer and Driver",
        "company": "German Embassy School Addis Ababa",
        "about": "TasksFacilitatingeffectivecommunication between theGerman Embassy School and stakeholders, e.g. the German Embassy, Ministries and other authorities, agencies and groups within Ethiopia. This may involve conveying information, coordinating meetings and representing the school.Obtaininformationindependentlyandproactivelyintheeventofchangesinthe local legal regulations or changes in processes that affect the school and advising the school to resolve issues, concerns, and problems promptly and efficiently.Assisting...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/2pMKTNbQyK-liaison-officer-and-driver"
    },
    {
        "title": "Teaching and Learning Program Manager",
        "company": "Luminos Fund",
        "about": "The Luminos Fund, an international nonprofit bringing education opportunities to the world’s most vulnerable and out-of-school children, is looking for a Teaching and Learning Program Manager for the Oromia Region in Ethiopia. This individual will lead the development and implementation of a structured pedagogy model for early primary school grades in Oromia.This is a hands-on role responsible for designing and implementing systems to support structured teaching and learning, including materials development, tea...",
        "location": "Oromia",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/xOArNNlGNm-teaching-and-learning-program-manager"
    },
    {
        "title": "Human Resource Officer Recruitment",
        "company": "CCECC Ethiopian Branch",
        "about": "CCECC Ethiopian BranchHuman Resource Officer RecruitmentPosition: Human Resource OfficerNumber of Vacancies: 1Salary: NegotiableClosing Date: August 24, 2025Company OverviewCCECC Ethiopian Branch is a leading organization committed to excellence in project execution and operational efficiency. We are seeking a highly competent Human Resource Officer to support our HR initiatives and ensure adherence to Ethiopian labor laws and best practices.Key Responsibilities1. HR Initiatives &amp; Systems Development:Support...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/kdEQdsZNCQ-human-resource-officer-recruitment"
    },
    {
        "title": "Audit Manager(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/8W5g9CYNGI-audit-managerreadvert"
    },
    {
        "title": "Finance Manager.",
        "company": "Samson Sport PLC",
        "about": "Responsible to: - The General Manager.A Finance Manager for a GYM and Rental Business would oversee all financial aspects, including accounting, budgeting, and financial reporting, ensuring compliance with regulations and maximizing profitability. The Manager would also be responsible for financial planning, analysis, and making recommendations to management.Responsibilities:Financial Planning and Analysis: Develop and implement financial plans, budgets, and forecasts for the GYM and Rental Business.Accounting a...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/MaqR8PD4tS-finance-manager"
    },
    {
        "title": "Facilities Manager (Operations Manager)",
        "company": "Samson Sport PLC",
        "about": "Reporting To: Chief Executive Officer (CEO)Employment Type: Full-Time, Senior LevelObjective:To uphold the highest standards of integrity and honesty at Laphto, promote the facility’s reputation, and ensure the delivery of excellent professional and personal service for the comfort and satisfaction of all guests.Scope:The Facilities Manager oversees all operational aspects of Laphto’s diverse amenities, including VIGOR Fitness, Bowlarama, the Rec. Room, and AQUA Club, ensuring compliance with legal, HR, and budg...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/MaTd0SCoNC-facilities-manager-operations-manager"
    },
    {
        "title": "Manager - Legal Advisor Division",
        "company": "Zemen Bank S.C",
        "about": "This position is responsible for assisting in the development of strategy, policies and procedures for legal function and managing all matters related to legal advice and other contracts that regulates the day to- day operations of the Bank.Major duties and responsibilitiesAssist in the development of legal service strategy, policies, and procedures of the bank, ensuring their effective implementation in the division.Plan, organize, direct, Coordinate and control the overall activities of the division.Assist in ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/liWTweErgP-manager-legal-advisor-division"
    },
    {
        "title": "(Re-Advertised) Project and Resource Mobilization Officer",
        "company": "Ethiopian Civil Society Organizations Forum (ECSF)",
        "about": "Reports To: Executive DirectorJob Type: Contract (One year with possibility of extension up on availability of fund)About Ethiopian Civil Society Organizations Forum (ECSF)The Ethiopian Civil Society Organizations Forum (ECSF) is a nonpartisan, independent, inclusive, and voluntary national platform established in May 2013 to address common concerns and challenges faced by Civil Society Organizations (CSOs) in Ethiopia. Re-registered by the Agency for Civil Society Organizations (ACSO) with Reg. No 4414 in 2019,...",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/4tn4Rzn8VD-re-advertised-project-and-resource-mobilization-officer"
    },
    {
        "title": "Commis Chef",
        "company": "Hyatt Regency Addis Ababa",
        "about": "Washes, peels, cuts, and seeds vegetables and fruits Responsible for emptying garbage and ensuring that paper towel dispensers and soap dispensers are filled daily.Cleans, cuts, and grinds meats, poultry, and seafood.Dips food items in crumbs, flour, and batter to bread them.Stirs and strains soups and sauces.Weights and measures designated ingredients.Carries pans, kettles, and trays of food to and from workstations, stove, and refrigerator.Stores foods in designated areasCleans work areas, equipment and utensi...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/GL3Df4jBED-commis-chef"
    },
    {
        "title": "Nutrition Advisor_ JEOP",
        "company": "GOAL Ethiopia",
        "about": "Reference No: REC/ 028 /25Job title:     Nutrition Advisor_ JEOPLocation:     Country Office – Addis Ababa, 50% travel to field sitesReports to:JEOP Project ManagerNumber of Posts01 (one)Closing date: July 31, 2025About the Position:The JEOP Nutrition Technical Advisor is a key staff member of the JEOP emergency nutrition response project. Her/his main duties include assisting the JEOP Project Manager in overseeing the project's implementation, such as monitoring work plans, program quality indicators, and budge...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/v3eYw306Hc-nutrition-advisor-jeop"
    },
    {
        "title": "Re - Advertised Regional Area Field coordinator",
        "company": "(RIDE) Hybrid Designs PLC",
        "about": "About the ProgramThe Mastercard Foundation in partnership with Hybrid Designs and its consortium partners- ICog, R&amp; D Group and Qua Qua Capitals as well as D &amp; T Ethiopia Management Consulting PLC are launching a five- year program entitled ‘Entrepreneurship in the Digital and Gig Economy (EDGE)’ with the aim of unlocking over 300,000 dignified and fulfilling employment opportunities for economically disadvantaged young people across Ethiopia through an innovative digitally enabled and mediated domestic ...",
        "location": "Not Specified",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/l7UqFwKH2v-re-advertised-regional-area-field-coordinator"
    },
    {
        "title": "Senior Accountant",
        "company": "Bunnamore Trading PLC",
        "about": "BUNNAMORE TRADING PLC – ILLYCAFFE FRANCHISECOMPANY SUMMARYJoin Our Team at Bunnamore!Bunnamore, a leading company in the food and beverage industry, is currently hiring for several key positions. We are proud to be the exclusive franchisee of Illycaffè in Ethiopia, with two successful stores in Addis Ababa. We are now expanding our footprint with a third location at the Ethiopian Airlines airport, furthering our commitment to providing premium coffee and an exceptional customer experience.We are looking for skil...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/XQfVhVHaee-senior-accountant"
    },
    {
        "title": "Junior Purchaser",
        "company": "Bunnamore Trading PLC",
        "about": "BUNNAMORE TRADING PLC – ILLYCAFFE FRANCHISECOMPANY SUMMARYJoin Our Team at Bunnamore!Bunnamore, a leading company in the food and beverage industry, is currently hiring for several key positions. We are proud to be the exclusive franchisee of Illycaffè in Ethiopia, with two successful stores in Addis Ababa. We are now expanding our footprint with a third location at the Ethiopian Airlines airport, furthering our commitment to providing premium coffee and an exceptional customer experience.We are looking for skil...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/R0FTzbl6lb-junior-purchaser"
    },
    {
        "title": "Outlet Manager",
        "company": "Hilton Addis Ababa",
        "about": "Job Summary:As an Outlet Manager, you are responsible for the daily operation of your outlet. This includes managing the team, driving sales, controlling costs, and ensuring high guest satisfaction. You will lead by example, train your staff, and ensure smooth and efficient service.Key Responsibilities:Operations &amp; Service:Oversee daily outlet operations from planning to executionEnsure guests receive consistent, high-quality serviceMaintain cleanliness and safety standards in line with hotel policiesEnsure ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/Vps5AGqW77-outlet-manager"
    },
    {
        "title": "Regional Project Officers",
        "company": "TaYA",
        "about": "BackgroundTaYA is a national civil society organization committed to promoting the health, rights, and wellbeing of women, youth, and vulnerable populations in Ethiopia. With a strong track record in sexual and reproductive health (SRH), gender-based violence (GBV) prevention and response, and youth empowerment, we work in partnership with communities and stakeholders to bring sustainable change.Regional Project Officers (2) (Somali and Amhara Region)Job DescriptionPosition Title=Regional Project OfficersReports...",
        "location": "Amhara",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/fLYiahj1XQ-regional-project-officers"
    },
    {
        "title": "Data collector/Enumerator",
        "company": "NRC (Norwegian Refugee Council)",
        "about": "Role and ResponsibilitiesData collector/Distributor will be reporting to M&amp;E Coordinator.The data collectors will be responsible to collect quality data by maintaining the different data quality assurance parameters – completeness, consistency, accuracy and timeliness. S/he shall not share the data to anyone other than the assigned data collection coordinator that is delegated by NRC.Generic ResponsibilitiesAdhere to NRC Policies, guidance and proceduresCarry beneficiary awareness and make arrangement on the...",
        "location": "Tigray",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/ozSCybQukw-data-collectorenumerator"
    },
    {
        "title": "WASH Officer - Hygiene Promotion",
        "company": "NRC (Norwegian Refugee Council)",
        "about": "Role and responsibilitiesThe WASH Officer (Hygiene and Sanitation Promotion) will lead the design, implementation, and monitoring of community hygiene and sanitation activities in his/her respective refugee camp and adjacent host communities. This role is critical for reducing WASH-related public health risks through behavior change methodologies, capacity building, and strategic coordination. The officer will ensure programming adheres to humanitarian standards (Sphere, WHO, UNHCR) while integrating gender, pro...",
        "location": "Somali",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/lAQPFQu5j8-wash-officer-hygiene-promotion"
    },
    {
        "title": "PROCUREMENT OFFICER",
        "company": "Première Urgence Internationale",
        "about": "Country Office:EthiopiaWork Base:Addis Ababa.Availability: As Soon As PossibleContract Duration:6 months with possibility of extensionFemale Candidates are Highly Encouraged to ApplyAbout Premier Urgency InternationalPremière Urgence Internationale (PUI) is a non-governmental, non-profit, non-political and non-religious international aid organization. Our teams are committed to supporting civilians’ victims of marginalization and exclusion, or hit by natural disasters, wars and economic collapses, by answering t...",
        "location": "Addis Ababa",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/8rkWrrY4mB-procurement-officer"
    },
    {
        "title": "MEAL Officer",
        "company": "People In Need - PIN",
        "about": "Our ProfilePeople in Need is a non-governmental, non-profit organization founded on the ideals of humanity, freedom, equality and solidarity.People in Need was established in 1992 by a group of Czech war correspondents, journalists and activists and has grown to become one of the largest non-profit organizations in Central and Eastern Europe.Throughout our 30 years of existence, People in Need continues to engage in humanitarian aid, development cooperation, education and social inclusion.We have been operating ...",
        "location": "Sidama",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/UtA98Lh400-meal-officer"
    },
    {
        "title": "Finance Officer",
        "company": "TaYA",
        "about": "BackgroundTaYA is a leading Ethiopian Civil Society Organization dedicated to empowering young people through integrated, youth-centered development programs. TaYA is implements multifaceted youth empowerment initiatives aiming to enable youth to lead economically productive lives, participate in governance, and contribute to sustainable peace and development.Position Title=Finance OfficerReports to=Project CoordinatorLocation=Debrebirhanand Tarmaber with 20% travel to 8 other woredas of North shewa zone, Amhara...",
        "location": "Amhara",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/DiQJd4Tgk5-finance-officer"
    },
    {
        "title": "Employability and Enterprise Development Coordinator",
        "company": "TaYA",
        "about": "BackgroundTaYA is a leading Ethiopian Civil Society Organization dedicated to empowering young people through integrated, youth-centered development programs. TaYA is implements multifaceted youth empowerment initiatives aiming to enable youth to lead economically productive lives, participate in governance, and contribute to sustainable peace and development.Position Title=Employability and Enterprise Development CoordinatorReports to=Project CoordinatorLocation=Debrebirhanand Tarmaber with 25% travel to 8 othe...",
        "location": "Amhara",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/8lMS934lrz-employability-and-enterprise-development-coordinator"
    },
    {
        "title": "Agriculture Livelihood Officer",
        "company": "TaYA",
        "about": "BackgroundTaYA is a leading Ethiopian Civil Society Organization dedicated to empowering young people through integrated, youth-centered development programs. TaYA is implements multifaceted youth empowerment initiatives aiming to enable youth to lead economically productive lives, participate in governance, and contribute to sustainable peace and development.Position Title=Agriculture Livelihood OfficerReports to=Project CoordinatorLocation=Debrebirhanand Tarmaber with 40% travel to 8 other woredas of North she...",
        "location": "Amhara",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/3a8GC3UvUZ-agriculture-livelihood-officer"
    },
    {
        "title": "Consultant/Trainer",
        "company": "Network of Ethiopian Women’s Associations (NEWA)",
        "about": "BackgroundNetwork of Ethiopian Women’s Associations (NEWA) is one of the pioneer national civil society networks in Ethiopia working for the respect of women's political, economic, social, and legal rights. Currently, NEWA has 50 member associations/organizations operating all over the country whose primary objective is creating an enabling environment for the empowerment of Ethiopian women and girls. Its member associations/organizations aim to advance women’s rights, gender equality, and women’s empowerment in...",
        "location": "Oromia",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/I70WZOznui-consultanttrainer"
    },
    {
        "title": "MEAL Coordinator",
        "company": "People In Need - PIN",
        "about": "Our ProfilePeople in Need is a non-governmental, non-profit organization founded on the ideals of humanity, freedom, equality and solidarity.People in Need was established in 1992 by a group of Czech war correspondents, journalists and activists and has grown to become one of the largest non-profit organizations in Central and Eastern Europe.Throughout our 30 years of existence, People in Need continues to engage in humanitarian aid, development cooperation, education and social inclusion.We have been operating ...",
        "location": "Sidama",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/EhG01goOGq-meal-coordinator"
    },
    {
        "title": "Principal Accountant",
        "company": "Premier Switch Solutions S. Co.",
        "about": "Premier Switch Solutions S.C.(PSS) is a leading Electronic Payment Processing Company, established by major private banks of Ethiopia. The Company has implemented the first multi-institution shared-switch infrastructure to provide its member banks with a state-of-the-art payment technology to drive ATM, POS, e-commerce, Mobile Banking and other payment channels and provide clearing of Debit/Credit card transactions for the banks. Currently, PSS has vacant position stated below and would like to invite applicants...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/do3nMiY49y-principal-accountant"
    },
    {
        "title": "General Service Officer I",
        "company": "Premier Switch Solutions S. Co.",
        "about": "Premier Switch Solutions S.C.(PSS) is a leading Electronic Payment Processing Company, established by major private banks of Ethiopia. The Company has implemented the first multi-institution shared-switch infrastructure to provide its member banks with a state-of-the-art payment technology to drive ATM, POS, e-commerce, Mobile Banking and other payment channels and provide clearing of Debit/Credit card transactions for the banks.Currently, PSS has vacant position stated below and would like to invite applicants ...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/Mm42DbzYtk-general-service-officer-i"
    },
    {
        "title": "Cashier",
        "company": "Islamic Relief",
        "about": "Internal/ExternalVacancy AdvertisementIR/INT/EXT/VN/018.25July 24, 2025Post Title:CashierDuty Station:Somali Regional State, JigjigaReports to:Finance Officer Salary: As per the organization scaleRequired:One Duration:One year with possible extension based on budget availability and performance IntroductionIslamic Relief is an international relief and development charity founded in 1984, headquartered in Birmingham, UK. As well as responding to disasters and emergencies, Islamic Relief promotes sustainable econo...",
        "location": "Somali",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/NbZ4il3XIm-cashier"
    },
    {
        "title": "General Service Officer",
        "company": "Wagwago Trading PLC",
        "about": "Job Summary:The General Service Officer is responsible for providing logistical, administrative, and operational support to ensure the smooth functioning of the company. The GSO oversees general office services, maintenance, procurement, asset management, and facility coordination. The role is integral in supporting core logistics operations by ensuring resources and services are available and functioning efficiently.Salary/ Compensation:NegotiableVacancy:01Duties and Responsibilities of theGeneral Services Offi...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/EFSZE9MbQf-general-service-officer"
    },
    {
        "title": "Auto Electrician",
        "company": "B & C Aluminum PLC",
        "about": "VACANT POSITION NOTICEB and C Aluminum PLC is a Private Company Established in 2002 and engaged in manufacturing aluminum products on world class quality mainly to import and fabricate for supplying high quality aluminum products like aluminum frame profiles with glasses and aluminum based products like composite panel &amp; curtain walls.Thus, we would like to employ competent and vibrant applicants for a newly established Garage to serve the vehicles of the company and its sister companies on the following pos...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/VSxmSaVP3W-auto-electrician"
    },
    {
        "title": "Light Duty Vehicle Auto Mechanic",
        "company": "B & C Aluminum PLC",
        "about": "VACANT POSITION NOTICEB and C Aluminum PLC is a Private Company Established in 2002 and engaged in manufacturing aluminum products on world class quality mainly to import and fabricate for supplying high quality aluminum products like aluminum frame profiles with glasses and aluminum based products like composite panel &amp; curtain walls.Thus, we would like to employ competent and vibrant applicants for a newly established Garage to serve the vehicles of the company and its sister companies on the following pos...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/quemmCsMpt-light-duty-vehicle-auto-mechanic"
    },
    {
        "title": "Radiologist",
        "company": "St. Gabriel General Hospital PVT.LTD.Co",
        "about": "Radiologist Job DescriptionWe are looking for radiologist to join our team of medical professionals. As a radiologist, you will use your skills and various medical imaging techniques to produce visual representations of specific areas of the human body in order to diagnose medical problems and monitor treatment. As a Radiologist you must be able to use medical imaging technologies, such as፡- X-rays, CT scans, ultrasounds, and MRIs and successfully execute and interpret the medical images in order to aid the diag...",
        "location": "Addis Ababa",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/dbvzE40SIj-radiologist"
    },
    {
        "title": "Accountant",
        "company": "Reach The Needy Ethiopia (RTN-Ethiopia)",
        "about": "Reach The Needy – Ethiopia (RTN-Ethiopia) is a child focused community based, not for profit, non-religious and discrimination free indigenous humanitarian national organization that exists to help the Deprived, Excluded and Vulnerable children become productive, confident and responsible citizens, parents and leaders of tomorrow that directly involve and contribute for the development of the country. RTN has been working Child Sponsorship, development &amp; humanitarian programs in partnership with ChildFund, C...",
        "location": "South Ethiopia Regional State",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/Exf7LQpDr9-accountant"
    },
    {
        "title": "Driver, Messenger",
        "company": "Reach The Needy Ethiopia (RTN-Ethiopia)",
        "about": "Reach The Needy – Ethiopia (RTN-Ethiopia) is a child focused community based, not for profit, non-religious and discrimination free indigenous humanitarian national organization that exists to help the Deprived, Excluded and Vulnerable children become productive, confident and responsible citizens, parents and leaders of tomorrow that directly involve and contribute for the development of the country. RTN has been working Child Sponsorship, development &amp; humanitarian programs in partnership with ChildFund, C...",
        "location": "South Ethiopia Regional State",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/fEYfavqf64-driver-messenger"
    },
    {
        "title": "Purchaser",
        "company": "Reach The Needy Ethiopia (RTN-Ethiopia)",
        "about": "Reach The Needy – Ethiopia (RTN-Ethiopia) is a child focused community based, not for profit, non-religious and discrimination free indigenous humanitarian national organization that exists to help the Deprived, Excluded and Vulnerable children become productive, confident and responsible citizens, parents and leaders of tomorrow that directly involve and contribute for the development of the country. RTN has been working Child Sponsorship, development &amp; humanitarian programs in partnership with ChildFund, C...",
        "location": "South Ethiopia Regional State",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/QKH9ZUfVnm-purchaser"
    },
    {
        "title": "Procurment officer or scrap supervisor",
        "company": "Abyssinia Integrated steel Plc (AGI)",
        "about": "ResponsibilitiesIdentify and approach potential new vendors and sources of metal scrapsVisit scrap yard, factories and construction /demolition sites to assess scrap availabilityCollect and verify scrap material details (type, Quality ,Quantity)Coordinate with the logistics for timely pickup slips and suppliersAssist with documentation , weighbridge slips and supplier’s payment follow upStay informed about market trends and price fluctuation",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/5n8ToZhG7Q-procurment-officer-or-scrap-supervisor"
    },
    {
        "title": "Fuel Attendant",
        "company": "Kerchanshe Trading Company",
        "about": "Job Summary :- The Fuel Attendant is responsible for the safe, accurate, and efficient dispensing of fuel to company vehicles, machinery, and equipment. The role includes maintaining detailed fuel transaction records, monitoring inventory levels, and ensuring full compliance with safety standards. The attendant is also expected to provide courteous service to drivers and operators, report any malfunctions or hazards, and maintain cleanliness in the fuel dispensing area. This position plays a critical role in sup...",
        "location": "Oromia",
        "deadline": "August 3rd, 2025",
        "url": "https://ethiojobs.net/job/et5Ccsw8hb-fuel-attendant"
    },
    {
        "title": "Marketing Manager",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Job Purpose:The Marketing Manager at Ashewa Technology Solution is responsible for developing, implementing, and executing strategic marketing plans to position the company as a leader in the Ethiopian tech industry. This role will focus on promoting Ashewa’s digital products, ERP systems, software solutions, and tech services through targeted campaigns, digital engagement, and strategic partnerships.Key Responsibilities:Strategic Marketing PlanningDevelop and execute comprehensive marketing strategies aligned w...",
        "location": "Addis Ababa",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/fHb916CJGT-marketing-manager"
    },
    {
        "title": "Regional Sales Manager/ Mekelle",
        "company": "Repi Soap & Detergent PLC",
        "about": "Purpose statementRegional Sales Manager is responsibilities for oversees the regional sales, distribution and customer service agenda for all distributors/ customers. This role is to build and overseeing the daily and long-term operations of a company's, leading the sales team comprised of Area Sales Managers, distributors and their sales representatives. This leader is accountable for achieving the Regional sales and profitability goals. This role provides direction and leadership to the Distributer and their s...",
        "location": "Tigray",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/D2qXvLLWqV-regional-sales-manager-mekelle"
    },
    {
        "title": "Finance Operation Coordinator",
        "company": "Plan International Ethiopia",
        "about": "The OpportunityThe Finance Operation Coordinator ensures accurate, timely, and compliant financial operations. Key duties include managing cash forecasting, payroll, statutory compliance, reconciliations, payments, documentation, and vendor accounts. The role also involves supervising and building team capacity, and aligning financial practices with organizational policies and national regulations.The coordinator is responsible for maintaining adequate cash flow, improving processes and systems to ensure timely ...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/Gpdgf7CYgY-finance-operation-coordinator"
    },
    {
        "title": "Sales Officer",
        "company": "Bekele Abshiro PLC",
        "about": "The Sales Officer is responsible for identifying and pursuing new business opportunities, maintaining relationships with clients, and meeting sales targets across various sectors served by BekDes Group. This role requires proactive outreach, detailed product knowledge, and strong communication skills.Key Duties and Responsibilities:      Identify, target, and engage potential clients in assigned sectors (e.g., hotels, gyms, institutions).Conduct regular field visits, calls, and outreach to generate qualified lea...",
        "location": "Addis Ababa",
        "deadline": "August 16th, 2025",
        "url": "https://ethiojobs.net/job/EckKwOWQ5r-sales-officer"
    },
    {
        "title": "Draftsman (Structural)",
        "company": "Ethiopian Engineering Corporation",
        "about": "Duties and Responsibilites:The individual will assume the full responsibility of drafting and documentation of disciplinespecific related works.Ability to work autonomously or as part of a larger team and able to make design decisions, act on own initiative and operate in a pro-active wayExcellent communication skillsWider knowledge of other disciplines highly desirableCapable of accurate work under pressure and able to work on several projects simultaneouslyAbility to assist other staff and BIM/Revit Technicians",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/3i26hsvYqW-draftsman-structural"
    },
    {
        "title": "Senior Procurement Engineer (Mechanical & Electrical) (Vacancy Code -MEP 009/2025)",
        "company": "Ethiopian Engineering Corporation",
        "about": "Position Overview/Scope of role:Work on getting /purchasing the best quality with the best price within the target dates from the suppliers and registering new subcontractors /suppliers when needed. Prepare tender, and float to supplier /subcontract.The Procurement Engineer investigates the market with specifications and performance requirements for MEP Material, analyses technical and commercial data based on the responses received, and re-iterates with bidders, recommending those most desirable using tools lik...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/8ZPNgW65nz-senior-procurement-engineer-mechanical-electrical-vacancy-code-mep-0092025"
    },
    {
        "title": "Senior Securities Registration & Reporting Officer II",
        "company": "Ethiopian Capital Market Authority",
        "about": "Statement of the PurposeThe job holder is responsible for managing security-related registration processes and reporting activities; and focuses on ensuring compliance, accuracy, and transparency in securities registration and disclosures.What We DoEthiopian Capital Market Authority is established by Capital Market Proclamation No 1248/2021 as an autonomous Federal Regulatory Authority. One of the major objectives of ECMA is to ensure the existence of a capital market environment in which securities can be issue...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/l97AnvGKKd-senior-securities-registration-reporting-officer-ii"
    },
    {
        "title": "Senior Securities Registration & Reporting Officer I",
        "company": "Ethiopian Capital Market Authority",
        "about": "Statement of the PurposeThe job holder is responsible for managing security-related registration processes and reporting activities; and focuses on ensuring compliance, accuracy, and transparency in securities registration and disclosures.What We DoEthiopian Capital Market Authority is established by Capital Market Proclamation No 1248/2021 as an autonomous Federal Regulatory Authority. One of the major objectives of ECMA is to ensure the existence of a capital market environment in which securities can be issue...",
        "location": "Addis Ababa",
        "deadline": "August 4th, 2025",
        "url": "https://ethiojobs.net/job/YKqAo75EBH-senior-securities-registration-reporting-officer-i"
    },
    {
        "title": "Holding Senior Secretary",
        "company": "Tamrin International Trading PLC",
        "about": "Job Title: Holding Senior Secretary IDepartment/Service:  Office of the DCEO, Holding Resources and Services Reports to:  DCEO, Holding Resources and Services ManagementAbout Tamrin Investment Holding CompanyTamrin Investment Holding aspires to be Ethiopia's premier investment holding company, driving sustainable growth across a diversified portfolio of subsidiaries. Our current subsidiaries include Tamrin Automotive, Tamrin Trade and Agriculture, Tamrin Transit, Forwarding and Logistics, Demera Hotel and Touris...",
        "location": "Addis Ababa",
        "deadline": "August 1st, 2025",
        "url": "https://ethiojobs.net/job/WcZ1wlndGd-holding-senior-secretary"
    },
    {
        "title": "Junior Medical Radiology Technology(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/Zp077HPuGh-junior-medical-radiology-technologyreadvert"
    },
    {
        "title": "Odoo Expert",
        "company": "Circle Research Services",
        "about": "Circle Research ServicesCircle Research Services is a visionary company founded by highly experienced professionals from prestigious institutions such as Harvard University. We specialize in providing research, monitoring, and evaluation services, with a strong commitment to empowering organizations to make a meaningful impact in global health and development. At Circle, we strive to be more than just a service provider—we aim to be a collaborative partner, dedicated to contributing to the betterment of disadvan...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/lySmuugHrC-odoo-expert"
    },
    {
        "title": "Sales Promoter",
        "company": "Habesha Breweries SC.",
        "about": "The Role Summary:The sales promoter is responsible for attracting new customers and improving profits, assisting with product launches and events, improving knowledge of the product range, answering questions, and addressing customerResult areas and responsibilitiesSales Performance &amp; Customer relationshipCreate sales from existing and new customers.Achieving daily sales volume target of the assigned territory and submitting sales reports.Identify potentially strategic outlets and effort to maximize the sale...",
        "location": "Oromia",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/bjge3BCYdP-sales-promoter"
    },
    {
        "title": "Nurse Professionals(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/gXTDepgjG3-nurse-professionalsreadvert"
    },
    {
        "title": "Emergency Critical Care Nurse(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/MHDkBKNZ4m-emergency-critical-care-nursereadvert"
    },
    {
        "title": "Audit Manager(readvert)",
        "company": "Washington Healthcare PLC",
        "about": "AboutWashingtonhealthcareWashington HealthCare Plc (WHC) is a specialized secondary care facility in Addis Ababa, providing quality and affordable healthcare to local and international communities. Managed by experienced Ethiopian, American, and visiting doctors, WMC opened in January 2015 and has since served over 120,000 patients. Initially an internal medicine specialty center, it offers 24-hour care with US and Ethiopian-trained doctors in sub-specialties like cardiology, neurology, and oncology. The center ...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/8W5g9CYNGI-audit-managerreadvert"
    },
    {
        "title": "Senior Business Application Specialist",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/MNSilp6oWg-senior-business-application-specialist"
    },
    {
        "title": "Project Manager – Ceramics Manufacturing",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/UQj6naE6PR-project-manager-ceramics-manufacturing"
    },
    {
        "title": "Project Manager – Paint & Construction Chemicals Manufacturing",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/TPc7PNVcuc-project-manager-paint-construction-chemicals-manufacturing"
    },
    {
        "title": "Operations Manager",
        "company": "Huawei Technologies Ethiopia PLC",
        "about": "Job DescriptionLead research, planning, design, and strategic development of mobile e-wallet products, focusing on optimizing features and improving the overall user experience.Develop and execute marketing campaign strategies aligned with the mobile e-wallet product operation calendar, oversee end-to-end campaign launches, and work towards achieving key marketing objectives.Design, implement, and analyze user lifecycle strategies to effectively engage users, increase retention, and maximize user value through t...",
        "location": "Addis Ababa",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/lNZY1h04ks-mobile-e-wallet-operations-manager"
    },
    {
        "title": "Consultancy",
        "company": "COMUNITA VOLONTARI PER IL MONDO (CVM)",
        "about": "CVM supports vulnerable segments of the community including survivors of human trafficking as part of this commitment, CVM has supported and contributed to the establishment of Yehiwot Menged Lewut Charity Organization (YMLC).YMLC is a Survivor-led Civil Society Organization which was certified on December 5, 2025, under registration number 7521 by Ethiopia Civil Society Organization. Founded by dedicated female survivors of human trafficking, YMLC is committed to dismantling trafficking, raising awareness about...",
        "location": "Addis Ababa",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/7LfKCuws9c-consultancy"
    },
    {
        "title": "Cashier",
        "company": "New Flower General Trading PLC",
        "about": "New Flower General Trading P.L.C. That Engaged In Different Business Ventures Like Coffe Cleaning And Warehousing, Foam Manufacturing, Import &amp; Export, Dry &amp; Liquid Transportation Service, Construction And Vehicles Assembly Is Looking For CompetentFollowing Positions.An internal auditor plays a crucial role in an organization by evaluating and improving the effectiveness of risk management, control, and governance processes.A cashier's primary responsibility isprocessing customer transactions, handling p...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/grRPLvGs2S-cashier"
    },
    {
        "title": "Senior Accountant",
        "company": "Paco Diary Food Industry PLC",
        "about": "Duties &amp; Responsibilities:Posting journal entries to accurately record all business transactions.Updating and maintaining accounts receivable and payable; issuing invoices and reconciling accounts.Preparing and processing payments such as invoices, payroll, and employee reimbursements.Number of employees required; 2",
        "location": "Addis Ababa",
        "deadline": "August 11th, 2025",
        "url": "https://ethiojobs.net/job/gG6vpI8hNM-senior-accountant"
    },
    {
        "title": "IT Manager",
        "company": "Africana Real State",
        "about": "Key or Major Responsibilities:Provide technical support and troubleshooting for software, hardware, and network-related issues.Install, configure, and maintain computer systems, applications, and peripheral devices.Support database, email, and web systems operations.Ensure system security through antivirus tools, firewalls, and regular updates.Assist in the development, testing, and maintenance of in-house software applications.Maintain accurate records of issues, solutions, and system configurations.Train end u...",
        "location": "Addis Ababa",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/FUc9jrBI7i-it-specialist"
    },
    {
        "title": "Project Manager – Cables Manufacturing (Power & Communication Cables)",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/Q89GO0lC8Q-project-manager-cables-manufacturing-power-communication-cables"
    },
    {
        "title": "Project Manager – Aluminum Profiles Manufacturing",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/DJD6DYsKi5-project-manager-aluminum-profiles-manufacturing"
    },
    {
        "title": "Project Manager – Glass Manufacturing (Float Glass & Container Glass)",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/7LN7vSEoHM-project-manager-glass-manufacturing-float-glass-container-glass"
    },
    {
        "title": "Deputy General Manager",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/Jo5LV8scWM-deputy-general-manager"
    },
    {
        "title": "Quality Assurance (QA) Manager",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Job SummaryThe QA Manager at Ashewa Technology Solutions will oversee the entire quality assurance process across software development, product delivery, and internal systems. This role ensures all deliverables meet high standards of quality, reliability, and compliance. The ideal candidate will work closely with engineering, product, and customer-facing teams to identify issues early, implement testing protocols, and foster a culture of continuous improvement.Key ResponsibilitiesDevelop, implement, and manage Q...",
        "location": "Addis Ababa",
        "deadline": "August 27th, 2025",
        "url": "https://ethiojobs.net/job/qWjBTjusLH-quality-assurance-qa-manager"
    },
    {
        "title": "Software Sales Supervisor",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Job Summary:As a Software Sales Supervisor, you will play a pivotal role in our sales success by bridging the gap between technology and customer needs. You will partner with our sales team to identify potential clients, understand their specific challenges, and present customized solutions from our portfolio.Responsibilities:Collaborate with the sales team to qualify leads, identify opportunities, and develop compelling sales environment.Conduct in-depth needs assessments to understand client pain points and bu...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/Mr6ndVrvEl-software-sales-supervisor"
    },
    {
        "title": "Software Sales Representative",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Job Summary:The Software Sales Representative at Ashewa Technology is a dynamic role responsible for driving sales growth and revenue generation across various tech sectors, including online marketplaces, ERP systems, site builders, custom software development, and more. The Sales Representative will leverage their technical expertise and industry knowledge to identify and pursue new business opportunities, provide consultative sales support, and build strong customer relationships. They will collaborate closely...",
        "location": "Addis Ababa",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/6Lz6jJS0ni-software-sales-representative"
    },
    {
        "title": "HR Officer",
        "company": "New Flower General Trading PLC",
        "about": "New Flower General Trading P.L.C. That Engaged In Different Business Ventures Like Coffe Cleaning And Warehousing, Foam Manufacturing, Import &amp; Export, Dry &amp; Liquid Transportation Service, Construction And Vehicles Assembly Is Looking For CompetentFollowing Positions.An internal auditor plays a crucial role in an organization by evaluating and improving the effectiveness of risk management, control, and governance processes.Job briefWe are looking for a skilled Senior HR Officer who will recruit, support...",
        "location": "Oromia",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/nQEneymZ4a-hr-officer"
    },
    {
        "title": "Internal Auditor",
        "company": "New Flower General Trading PLC",
        "about": "New Flower General Trading P.L.C. That Engaged In Different Business Ventures Like Coffe Cleaning And Warehousing, Foam Manufacturing, Import &amp; Export, Dry &amp; Liquid Transportation Service, Construction And Vehicles Assembly Is Looking For CompetentFollowing Positions.An internal auditor plays a crucial role in an organization by evaluating and improving the effectiveness of risk management, control, and governance processes.Certifications (Optional)Certified Internal Auditor (CIA)Certified Information Sy...",
        "location": "Addis Ababa",
        "deadline": "August 8th, 2025",
        "url": "https://ethiojobs.net/job/xHYtftE2vI-internal-auditor"
    },
    {
        "title": "Community Development Facilitator (CDF)",
        "company": "Reach The Needy Ethiopia (RTN-Ethiopia)",
        "about": "Reach The Needy – Ethiopia (RTN-Ethiopia) is a child focused community based, not for profit, non-religious and discrimination free indigenous humanitarian national organization that exists to help the Deprived, Excluded and Vulnerable children become productive, confident and responsible citizens, parents and leaders of tomorrow that directly involve and contribute for the development of the country. RTN has been working Child Sponsorship, development &amp; humanitarian programs in partnership with ChildFund, C...",
        "location": "South Ethiopia Regional State",
        "deadline": "August 5th, 2025",
        "url": "https://ethiojobs.net/job/MHvv72kOwk-community-development-facilitator-cdf"
    },
    {
        "title": "Accounting and Administrative assistant",
        "company": "Embassy of Luxembourg",
        "about": "Under the authority and supervision of the Head of Mission and the Deputy Head of Mission, you will be required to perform the following tasks:Ensure the day-to-day management of the Secretariat of the Embassy, including accounting using Microsoft ExcelManage the agendas of the Embassy team as well as the official correspondence and communicationLiaise with other Embassies, UN agencies and African Union to coordinate meetings/eventsOversight of the archiving of all incoming and outgoing Embassy correspondenceAss...",
        "location": "Addis Ababa",
        "deadline": "August 25th, 2025",
        "url": "https://ethiojobs.net/job/w5CakdTenD-accounting-and-administrative-assistant"
    },
    {
        "title": "Dialysis Nurse",
        "company": "MeQrez Health services",
        "about": "MeQrez Health Services is a share company established in October 2020, dedicated to strengthening Ethiopia's healthcare sector. Our primary mission is to establish organizations within the health industry to alleviate the nation's healthcare challenges through initiatives such as general hospitals, a chain of pharmacies, imaging and diagnostic centers, and the import and export of pharmaceuticals and medical supplies.In our initial phase, MeQrez has committed to enhancing the well-being of our clients by deliver...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/VLdWSXys5f-dialysis-nurse"
    },
    {
        "title": "TERMS OF REFERENCE FOR EMPLOYABILITY SKILL TRAINING",
        "company": "Light for the World",
        "about": "AboutLightfortheWorldLight for the World is a global disability and development organization. We empower people with disabilitiesandenableeyehealthservicesinlow-incomecountries.Overthelastthreedecades,wehave improved health systems, enabled education for all, and amplified the voices of people with disabilities.Ourprograms include:EyeHealth–preventingblindnessandpromotingeyehealthforall.InclusiveEducation–ensuringchildrenwithdisabilitiesreceivequality,inclusiveeducation.InclusiveEconomicEmpowerment–ensuringthatb...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/tilC5kyfav-terms-of-reference-for-employability-skill-training"
    },
    {
        "title": "Intensive Care Unit (ICU) Nurse",
        "company": "MeQrez Health services",
        "about": "MeQrez Health Services is a share company established in October 2020, dedicated to strengthening Ethiopia's healthcare sector. Our primary mission is to establish organizations within the health industry to alleviate the nation's healthcare challenges through initiatives such as general hospitals, a chain of pharmacies, imaging and diagnostic centers, and the import and export of pharmaceuticals and medical supplies.In our initial phase, MeQrez has committed to enhancing the well-being of our clients by deliver...",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/R5xPEZOBnB-intensive-care-unit-icu-nurse"
    },
    {
        "title": "Local Procurement (Purchasing) Manager",
        "company": "Hagbes Private Limited Company",
        "about": "Develop, manage and update local purchasing plan and report performances to ensure that Company objectives and goals are achieved;Evaluate and analyze department’s performance and communicate recommendation on potentials for improvement to the top management of the Company;Establish and revise thepolicies, procedures and work instructions of Local Procurementsection;Establish effective lines of communication to ensure timely delivery of commodities using the most appropriate Local Procurementprocedures;Collabora...",
        "location": "Addis Ababa",
        "deadline": "August 27th, 2025",
        "url": "https://ethiojobs.net/job/c3QBsLe8nf-local-procurement-purchasing-manager"
    },
    {
        "title": "Senior Accountant",
        "company": "Dodai Manufacturing Plc.",
        "about": "About DodaiDodai Manufacturing Plc (Dodai), is a recently incorporated organization launched in Addis Ababa, Ethiopia on August 01, 2023. Dodai is a fast growing organization with a mission of making e-mobility accessible to everyone in Africa through its innovative products and services. Dodai plans to provide brand new electric two wheelers by assembling them here in Addis Ababa and plans to expand to major regional cities in Ethiopia by the end of 2025.Purpose of the PositionThe Senior Accountant will be resp...",
        "location": "Addis Ababa",
        "deadline": "August 27th, 2025",
        "url": "https://ethiojobs.net/job/QguUorlu9i-senior-accountant"
    },
    {
        "title": "Laboratory Technician",
        "company": "AIDS Healthcare Foundation - Ethiopia (AHF-Ethiopia)",
        "about": "AIDS Healthcare Foundation is a global not-for-profit organization that provides cutting-edge medicine and advocacy to more than 2 million patients in 46 countries globally, 14 of these countries being in Africa, and is headquartered in Los Angeles, California, USA.Since 1987, AHF has cared for thousands of people living with HIV and AIDS worldwide. As we create and implement unparalleled programs in new communities globally, we expand the delivery of healthcare and influence over strategies with the sole aim of...",
        "location": "Addis Ababa",
        "deadline": "August 6th, 2025",
        "url": "https://ethiojobs.net/job/U0uYA3o0OL-laboratory-technician"
    },
    {
        "title": "Early School (Kindergarten) Directoress",
        "company": "Yemen International Community School",
        "about": "The Early School Director (female only) is responsible for the overall leadership, management, and development of the early years program, ensuring it reflects international best practices and aligns with the school’s mission and values. She will oversee curriculum implementation, staff supervision, and the creation of a nurturing, engaging, and safe learning environment for young children. The Director leads the early years team, ensures high-quality teaching and learning, fosters strong communication with pare...",
        "location": "Addis Ababa",
        "deadline": "August 9th, 2025",
        "url": "https://ethiojobs.net/job/3mjfxbhVNG-early-school-kindergarten-directoress"
    },
    {
        "title": "Curriculum Lead",
        "company": "Yemen International Community School",
        "about": "The Curriculum Lead for the Pearson curriculum is responsible for overseeing the effective planning, implementation, and continuous improvement of Pearson Edexcel programs across all key stages. This role involves guiding subject teachers in aligning their instruction with curriculum standards, ensuring coherence and academic rigor, and supporting assessment preparation including Checkpoint, IGCSE, and A-Level exams. The Curriculum Lead provides instructional leadership, conducts lesson observations, facilitates...",
        "location": "Addis Ababa",
        "deadline": "August 9th, 2025",
        "url": "https://ethiojobs.net/job/j5gmu8EWtu-curriculum-lead"
    },
    {
        "title": "Teachers from Reception 1 to Year 9",
        "company": "Yemen International Community School",
        "about": "Teachers of the Pearson curriculum are responsible for delivering high-quality instruction aligned with Pearson Edexcel standards, ensuring students achieve academic excellence in their respective subjects. They plan and deliver engaging, student-centered lessons that promote critical thinking, problem-solving, and real-world application. Teachers must prepare students for internal and external assessments, including checkpoint and IGCSE/International A-Level exams, using a variety of teaching strategies and dig...",
        "location": "Addis Ababa",
        "deadline": "August 9th, 2025",
        "url": "https://ethiojobs.net/job/mXHItYSlqQ-teachers-from-reception-1-to-year-9"
    },
    {
        "title": "HR Officer",
        "company": "Ashewa Technology Solution S.C.",
        "about": "Job SummaryThe HR Officer is responsible for supporting day-to-day HR operations, including recruitment, employee relations, record-keeping, and compliance. A key part of this role involves coordinating and facilitating employee training and development initiatives to build internal capacity and drive performance.Key ResponsibilitiesSupport the recruitment process, including posting job ads, screening candidates, scheduling interviews, and onboarding new hires.Maintain and update employee records in both physica...",
        "location": "Addis Ababa",
        "deadline": "August 27th, 2025",
        "url": "https://ethiojobs.net/job/Xedb0EIl4z-hr-officer"
    },
    {
        "title": "Project Manager, WFP/TSFP",
        "company": "Plan International Ethiopia",
        "about": "The OpportunityThe post holder will coordinate the WFP/TSFP project in the respective regions and ensure that projects are implemented in target locations according to the agreements made with government signatory offices. He or she will provide hands-on guidance, support, mentoring, and coaching to frontline staff, including Coordinators, Officers, and Social Workers, to ensure the smooth and quality implementation of the project. This role involves coordinating with the Ministry of Health (MOH), WFP, and other...",
        "location": "Addis Ababa",
        "deadline": "July 31st, 2025",
        "url": "https://ethiojobs.net/job/8xxNkWGFno-project-manager-wfptsfp"
    },
    {
        "title": "Internet Promoter",
        "company": "META ZION TRADING PLC",
        "about": "High salary recruitment internet promotionJob ResponsibilitiesHandle customer consultation issues promptly through the Internet ;Good at English communication, patient and motivated. Have a certain ability to withstand pressure;Have high enthusiasm for work and strictly abide by company rules and regulations .Salary and BenefitsSalary: a net salary of 12,000, with bonuses provided separately.Benefits: statutory holidays, paid training, daily/weekly/monthly bonuses for outstanding employees , and holiday benefits...",
        "location": "Addis Ababa",
        "deadline": "August 26th, 2025",
        "url": "https://ethiojobs.net/job/p8Ji8h9XKM-internet-promoter"
    },
    {
        "title": "Bartender",
        "company": "Haile & Alem International PLC",
        "about": "Responsible for preparing and serving drinks to guests in a professional and efficient manner; required to interact with customers, take orders, and provide recommendations on beverages; and be responsible for maintaining a clean and organized work area and ensuring guest satisfaction.",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/D3wQGC3IZ9-bartender"
    },
    {
        "title": "General Maintenance Technician",
        "company": "Haile & Alem International PLC",
        "about": "Responsible to maintain and keep all equipment in good working conditions by providing day-to-day maintenance of thehotel; to complete maintenance work orders from all departments on a timely basis by following hotels standard operating procedures.",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/a8NcfkhH0G-general-maintenance-technician"
    },
    {
        "title": "Guest Service Agent (Receptionist)",
        "company": "Haile & Alem International PLC",
        "about": "Responsible to welcome, check-in and check-out guests; handle guest complain, and any guest relation issues; gives proactive service to customers; and maximize room revenue and guest satisfaction.",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/KVspefkODs-guest-service-agent-receptionist"
    },
    {
        "title": "Engineering Supervisor",
        "company": "Haile & Alem International PLC",
        "about": "Responsibleforallaspectsof theday-to-dayoperationsof thehotel's maintenance, operations,andrepairs.",
        "location": "Addis Ababa",
        "deadline": "August 2nd, 2025",
        "url": "https://ethiojobs.net/job/LLilVJg3lJ-engineering-supervisor"
    },
    {
        "title": "Consultancy opportunity for Technical Assistance under the Ethiopia Hotspot  Building Survivor-Led Leadership and Sisterhood Capacity Strengthening for women survivors and Returnee leaders",
        "company": "Freedom Fund",
        "about": "The Freedom Fund has been supporting the collectivization of women survivor and migrant worker led groups in Ethiopia since 2022. This has been executed through both unrestricted grants, access to conference and donor convening opportunities as well as incorporation into regular program activities through specific projects and deliverables.In 2025 The Freedom Fund Ethiopia Hotspot began a new program of work with the goal of increasing Domestic Workers (DWs) protection through their migration journey from their ...",
        "location": "Addis Ababa",
        "deadline": "August 21st, 2025",
        "url": "https://ethiojobs.net/job/cgpIor3QCC-consultancy-opportunity-for-technical-assistance-under-the-ethiopia-hotspot-building-survivor-led-leadership-and-sisterhood-capacity-strengthening-for-women-survivors-and-returnee-leaders"
    },
    {
        "title": "Mechanical Engineer",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/vLnv4dXt3k-mechanical-engineer"
    },
    {
        "title": "Bending Machine Operator",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/LzLqwAnFN8-bending-machine-operator"
    },
    {
        "title": "Excavator Operator",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/zSHLoA0coE-excavator-operator"
    },
    {
        "title": "Senior Coffee Certification Expert",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/1ZUebmmdPB-senior-coffee-certification-expert"
    },
    {
        "title": "Logistics Officer",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/1h3fyY0oCf-logistics-officer"
    },
    {
        "title": "Senior Marketing Officer",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/IC42tLi96C-senior-marketing-officer"
    },
    {
        "title": "Public Relation Officer",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/SjtQg54Pck-public-relation-officer"
    },
    {
        "title": "Drafts Person",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/ZoL8tAKM9z-drafts-person"
    },
    {
        "title": "Branch Manager",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Oromia",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/SN56Mxey66-human-resource-manager"
    },
    {
        "title": "Human Resource Manager",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City), and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is...",
        "location": "Oromia",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/tPu8WEUZls-human-resource-manager"
    },
    {
        "title": "System Administrator",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/s5RFeuoP9f-system-administrator"
    },
    {
        "title": "Senior Network Administrator",
        "company": "AMG Holding",
        "about": "About USAMG Holdings is a leading and diversified business group headquartered in Ethiopia. Established in 2010 G.C., the Company has grown into a prominent player across multiple sectors, including steel manufacturing, coffee export, Energy, and real estate. AMG Holdings operates within two large-scale industrial parks located in Adama and Sheger City (Gelan Sub-City) and continues to expand its footprint with a strong commitment to innovation, operational excellence, and sustainable growth. Now Our Company is ...",
        "location": "Addis Ababa",
        "deadline": "August 7th, 2025",
        "url": "https://ethiojobs.net/job/fvIqk2YIhl-senior-network-administrator"
    }
]